{
  "blogs": [
    {
      "id": "1759294411654",
      "title": "Amref Crashing Doctors",
      "body": "AMREF Flying Doctors has confirmed that one of its aircraft, a Cessna Citation XLS, registration 5Y–FDM, crashed on Thursday in the Mwihoko area of Nairobi shortly after takeoff from Wilson Airport.<br><br>The plane, which departed Wilson at 2:17 p.m. en route to Hargeisa, Somalia, was involved in a fatal accident, according to a statement signed by AMREF CEO and Accountable Manager Stephen Gitau.<br><br>“At this time, we are cooperating fully with relevant aviation authorities and emergency response teams to establish the facts surrounding the situation,” the statement read.<br>AMREF said its immediate focus is on the safety and well-being of those on board and pledged full support to their families and colleagues. The organization also committed to providing all necessary assistance to the authorities as investigations continue.<br><br>“Further information will be provided as soon as it is confirmed. We respectfully ask for patience and understanding as we manage this evolving situation with care and accuracy,” Gitau added.<br><br>The medical evacuation service said all official updates will be shared through its website and social media platforms.",
      "author": "Denish Awajo",
      "date": "October 1, 2025",
      "timestamp": 1759276800000,
      "categories": [
        "Tragedy"
      ],
      "tags": [],
      "imageUrl": "/images/amref.jpeg"
    },
    {
      "id": "1759294544009",
      "title": "Blood Moon",
      "body": "Kenyans from all walks of life turned their eyes to the sky on the night of September 8, 2025, to witness a rare and dramatic total lunar eclipse, popularly known as the \"Blood Moon.\" The celestial event, one of the longest of its kind in recent memory, was a moment of scientific fascination and cultural significance across the nation.<br><br>The eclipse was the backdrop for a major new tourism initiative by the Kenya Tourism Ministry and the Kenya Space Agency. A dedicated \"astro-tourism\" experience was launched in Samburu County, an area known for its pristine, low-light-pollution skies. <br><br>Tourists and local communities gathered at Sopa Lodge in Samburu National Reserve, using telescopes and their naked eyes to watch the moon turn a deep, rusty red as it passed into Earth's shadow. The initiative aims to diversify Kenya's tourism offerings and capitalize on the country's clear skies to attract astronomy enthusiasts and adventure travelers.<br><br>While many viewed the eclipse through a modern, scientific lens, the event also brought to the forefront the rich and diverse cultural interpretations of celestial phenomena in Kenya.<br>For some indigenous communities, like the Samburu and Maasai, a lunar eclipse holds layered meanings. Some traditions view the reddened moon as an unfavorable omen, while others see it as a reflection of a struggle in the heavens. Some Maasai traditions involve loud chants and calls to encourage the spirit that has \"swallowed\" the moon to release it.<br>“It is a symbol of new beginnings and renewal,” Githunguri MP Gathoni Wamuchomba posted on social media.<br><br>Beyond the scientific and traditional views, the Blood Moon was a moment of shared experience for Kenyans. From cities to rural areas, people gathered to watch the spectacle. Social media was flooded with photos and videos of the eclipse, with many sharing their awe and wonder. The event served as a reminder of how astronomical occurrences can bridge the gap between scientific fact and lived human experience, bringing people together under a single, shared sky.",
      "author": "Denish Awajo",
      "categories": [
        "Science"
      ],
      "tags": [],
      "date": "October 1, 2025",
      "timestamp": 1759276800000,
      "imageUrl": "/images/redmoon.jpeg"
    },
    {
      "id": "1759295507983",
      "title": "Roe v Wade?",
      "body": "Residents of Thika are raising alarm over the increasing cases of aborted fetuses being dumped in the area, a trend they say has become frequent.<br><br>According to locals, these cases have become too common, and a month hardly goes by without such cases being reported. They attribute these cases to teen pregnancies and students in tertiary institutions in the area who engage in casual sexual behavior, resorting to unsafe abortions.<br><br>In the latest case, two fetuses were found dumped in two different locations in Kisii estate, where those who discovered the fetuses were in shock and estimated them to be of six to eight months old. “These are babies all their body parts are well developed; hence they may be between 6 to 8 months. It’s sad to see someone kill a child, why not use family planning methods?” One of the witnesses said.<br><br>Catherine Mwende, a senior citizen in the area expressed her disappointment over what she termed as moral decay. “Children these days are engaging in casual sexual behaviors that leads to unwanted pregnancies or worse diseases. Having no ability to take care of babies, they resort to dangerous abortions, which is why we are seeing fetuses dumped all over,” she said.<br><br>Police have confirmed the growing trend, noting that cases of abandoned fetuses have sharply increased in recent months. “We are frequently called to collect fetuses dumped in various parts of Thika. It is an issue of serious concern,” an officer said.<br><br>Residents are now calling on authorities, religious leaders, and health officials to intensify sensitization on reproductive health and family planning, while also urging the government to crack down on illegal abortion practices in the area.<br><br>While the Kenyan Constitution (2010) permits abortion only when the mother’s life or health is at risk, many women and girls especially in urban and peri-urban areas such as Thika resort to illegal and unsafe procedures, often leading to medical complications or death.",
      "author": "Ejidio Maina",
      "categories": [
        "Human Interest"
      ],
      "tags": [],
      "date": "October 1, 2025",
      "timestamp": 1759276800000,
      "imageUrl": "/images/abort.jpeg"
    },
    {
      "id": "1759505494093",
      "title": "The Cost of Higher Education",
      "body": " University students across the country are facing tough times following the implementation of the new university funding model, introduced by the government in 2023.<br><br>The model, which replaced the previous blanket Higher Education Loans Board (HELB) system, is based on students' financial need and household income. While the government said the new approach would ensure fairness and support the most vulnerable students, many learners say it has created new challenges.<br><br>“I applied for full government support, but I only got a partial scholarship and no HELB loan. My parents are unemployed, and now I'm struggling to raise fees,” said Janet Wanjiku, a second-year student at the University of Nairobi.<br>Under the new model, students are categorized into four levels; vulnerable, extremely needy, needy, and less needy  based on the Means Testing Instrument (MTI). However, some students claim the tool used to assess financial background is inaccurate or too general.<br><br>“The system doesn't consider that I have younger siblings in school. Just because my guardian owns a small business, they assumed I can afford university fees,” said Brian Kipkoech, a student at Moi University.<br><br>University administrators have also raised concerns. According to officials, delayed disbursement of funds has disrupted operations, and many students are at risk of deferring studies due to unpaid tuition.<br><br>Education Cabinet Secretary Julius Migos Ogamba has defended the model, saying it is still being fine-tuned and urged students to be patient.<br>But student leaders want urgent reforms.<br><br>“We are not against reforms, but the government must listen to our concerns. Education is a right, not a privilege,” said Mercy Achieng, a student leader from Kenyatta University.<br><br>As the academic year progresses, thousands of students are hoping for adjustments to the model to make university education more accessible and equitable for all.",
      "author": "George Mwangi",
      "categories": [
        "Education"
      ],
      "tags": [],
      "date": "October 3, 2025",
      "timestamp": 1759449600000,
      "imageUrl": "/images/Education.jpeg"
    },
    {
      "id": "1759505591075",
      "title": "Uhuru's Comeback",
      "body": "Former President Uhuru Kenyatta has made a political comeback by leading a major delegates meeting aimed at reviving the Jubilee Party. The meeting, held at the Ngong Race Course in Nairobi on Friday, marked the party's first major gathering in four years.<br><br>Hundreds of delegates from across the country attended the event, which signaled renewed efforts to reorganize and re-energize the once-dominant political party.<br><br>“We are not dead. We are here, and Jubilee is back stronger and more focused,” Uhuru said in his address, receiving cheers from party supporters. “This is the time to rebuild and realign ourselves with the needs of Kenyans.”<br><br>The former president, who has kept a low political profile since leaving office in 2022, used the platform to call for unity and discipline within the party. He criticized attempts by rival factions to dislodge the party's leadership and assured members that Jubilee would remain a key player in the country's political landscape.<br><br>The delegates' conference also resolved to form a task force to review the party constitution, strengthen grassroots structures, and prepare for the 2027 General Election.<br><br>Political analysts say Uhuru's reappearance could shake up opposition politics and potentially affect the dynamics within the Azimio coalition, which Jubilee is affiliated with.<br><br>“This meeting shows that Uhuru is not done with politics. He still has influence, especially in Mount Kenya,” said political commentator Prof. Macharia Munene<br>However, critics argue that reviving Jubilee may be an uphill task, citing internal wrangles, defections, and a changed political landscape dominated by Kenya Kwanza and ODM.<br><br>Despite the challenges, Uhuru's message was clear: Jubilee is not ready to be written off.",
      "author": "George Mwangi",
      "date": "October 3, 2025",
      "timestamp": 1759449600000,
      "categories": [
        "Politics"
      ],
      "tags": [],
      "imageUrl": "/images/Uhuru.jpeg"
    },
    {
      "id": "1759505704182",
      "title": "Justice Delayed",
      "body": "A dark cloud hangs over Endarasha in Nyeri County after a tragic dormitory fire at Hillside Academy claimed the lives of 21 young late last year. The fire, which broke out in the middle of the night, has left families devastated and the nation in mourning.<br><br>Now, the families of the 21 boys have taken legal action. On Thursday, they filed a case at the Nyeri High Court, suing the Ministry of Education, the management, and the owners of Hillside Academy. They are accusing them of negligence and failure to ensure the safety of learners.<br><br>“This was not just an accident it was a disaster waiting to happen. There were no emergency exits, no fire extinguishers, and the dormitory was overcrowded,” said James Mwangi, a parent who lost his son in the fire.<br><br>According to preliminary investigations, the school did not meet several basic safety standards. Witnesses say students were trapped inside the burning dormitory with no way to escape, as metal grills had been installed on the windows for \"security purposes.\"<br><br>The Education Cabinet Secretary has ordered a nationwide audit of boarding school infrastructure, but the families say the response is too little, too late.<br>“We want justice. No other parent should go through what we are going through,” said Mary Nyawira, another grieving parent, during a press briefing outside the court.<br><br>The management of Hillside Academy has not publicly responded to the lawsuit but earlier said they are \"cooperating with authorities\" in the ongoing investigations.<br><br>The tragedy has sparked public outrage, with many calling for stricter enforcement of safety standards in private and public schools.<br>As the case proceeds in court, 21 families continue to grapple with unspeakable loss and the hope that justice will one day bring them some peace.",
      "author": "George Mwangi",
      "date": "October 3, 2025",
      "timestamp": 1759449600000,
      "categories": [
        "Tragedy"
      ],
      "tags": [],
      "imageUrl": "/images/Endarasha.jpeg"
    },
    {
      "id": "1759505772345",
      "title": "Meru Music Festival",
      "body": "Meru County came alive with music, dance, and cultural pride as it hosted the recently concluded National Music Festivals 2025, drawing participants and spectators from across the country.<br>The week-long event, which brought together learners from primary schools, secondary schools, colleges, and universities, was held at Meru School and Meru University, marking one of the most vibrant festivals in recent years.<br>From traditional folk songs to contemporary choral performances, poetry recitals, solo verses, and dramatized dances, the festival showcased Kenya's rich cultural diversity and the immense talent among the youth.<br>“This year's theme — Promoting National Unity Through Music and Cultural Expression — truly came to life. We witnessed performances in over 40 local languages,” said Dr. Benson Abwao, Chairperson of the Kenya Music Festivals Committee.<br>Among the standout performers were Kakamega High School, whose African narrative dance won standing ovations, and Kenyatta University, which dominated the choral verse categories.<br>The festival also attracted dignitaries, including officials from the Ministry of Education, county leaders, and cultural ambassadors. Education Cabinet Secretary Julius Migos Ogamba praised the event for nurturing creativity and promoting national cohesion.<br>“These festivals are not just about competition ,they're about identity, heritage, and building bridges among communities,” he said during the closing ceremony.<br>Meru Governor Isaac Mutuma also commended local residents for hosting thousands of visitors with warmth and hospitality.<br>As curtains closed on the 2025 edition, participants expressed joy and pride not just in winning, but in telling their stories through music and art.",
      "author": "George Mwangi",
      "date": "October 3, 2025",
      "timestamp": 1759449600000,
      "categories": [
        "Entertainment"
      ],
      "tags": [],
      "imageUrl": "/images/meru.jpeg"
    },
    {
      "id": "1759505879154",
      "title": "Kenya Wins Big in Tokyo",
      "body": "Kenya is celebrating a historic achievement after finishing second globally at the recently concluded World Athletics Championships held in Tokyo, Japan.<br>Team Kenya brought home an impressive total of 11 medals — 7 gold, 2 silver, and 2 bronze finishing just behind the United States, who topped the table.<br><br>The championships, which brought together elite athletes from over 190 countries, saw Kenya dominate in its traditional strongholds of middle- and long-distance races.<br><br>Among the standout performances was Faith Kipyegon, who once again proved her dominance by winning gold in both the 1500m and 5000m races. She was joined by Emmanuel Wanyonyi, who stormed to victory in the 800m, and Beatrice Chebet, who took gold in the 10,000m.<br><br>“This is one of our best performances in recent memory,” said Team Kenya head coach Julius Kirwa. “Our athletes showed resilience, discipline, and true Kenyan spirit.”<br><br>President William Ruto led the nation in congratulating the team, promising enhanced investment in sports development and athlete welfare.<br>“You have lifted our flag high and made us proud. Kenya remains a powerhouse in athletics,” the president said in a statement.<br><br>The Ministry of Sports has announced a hero's welcome for the athletes upon their return, with plans underway for a celebratory parade in Nairobi and Eldoret.",
      "author": "George Mwangi",
      "date": "October 3, 2025",
      "timestamp": 1759449600000,
      "categories": [
        "Sport"
      ],
      "tags": [],
      "imageUrl": "/images/tokyo.jpeg"
    },
    {
      "id": "1759506094748",
      "title": "Safaricom's B-Live",
      "body": "Leading telecommunications company Safaricom has launched a new data product dubbed \"B Live\", targeting Kenya's growing digital community with a bold promise - data that doesn't expire, unless the user-defined usage period elapses.<br><br>The new bundle, which allows users to choose how long they want the data to remain active, has been described as a game-changer, especially for content creators, freelancers, and remote workers who rely heavily on stable internet for uploading and managing content.<br><br>“This is not your typical data bundle. With B Live, the data remains available throughout your chosen period, whether it's 24 hours, 3 days, or a full month. No more worrying about daily expiries,” said Peter Ndegwa, CEO of Safaricom, during the product launch event held in Nairobi.<br><br>The bundle is available on the MySafaricom App and via USSD, and customers can customize their data plans based on budget and duration. It also includes options for hotspot use, streaming, and uploading large files — features that are proving especially popular among video editors, TikTok influencers, YouTubers, and online entrepreneurs.<br><br>Digital creator Marion Mwangi, known for her travel vlogs, welcomed the move: “Sometimes uploading a single video takes hours. With B Live, I don't have to stress about my bundle expiring midway. It's perfect for creators like me.”<br>Industry analysts say the launch of B Live is a  to shifting data consumption habits, especially among Gen Z and millennials, who strategic response  demand flexibility and value in digital services.<br><br>“This positions Safaricom strongly in the digital content economy. It also sets the pace for how telecoms will package data in the future,” said ICT analyst Brian <br>Mwangi.<br><br>The launch of B Live comes amid increased competition in Kenya's telecom sector, with rivals such as Airtel and Telkom Kenya also rolling out creative data offerings.",
      "author": "George Mwangi",
      "date": "October 3, 2025",
      "timestamp": 1759449600000,
      "categories": [
        "Business"
      ],
      "tags": [],
      "imageUrl": "/images/safaricom.jpeg"
    },
    {
      "id": "1759506231362",
      "title": "Rosie's Journey",
      "body": "In the lively corridors of Kibera, Rosie Mumbua's giggle pierces the noise of everyday activity. The 32-year-old mother of three, returning after seven years as a nanny in Qatar, has exchanged Doha's tall buildings for her adobe-walled residence<br><br>In 2017, Rosie left Nairobi, driven by unpaid school fees and an empty fridge. “I promised my kids a better life,” she recalls, stirring ugali in her one-room shack. Qatar offered KSh 50,000 monthly, a lifeline for her family.  <br><br>But reality stung. Sixteen-hour shifts, a confiscated passport, and no days off defined her Doha days. “I sang lullabies over WhatsApp,” Rosie says, her voice heavy. Her kids Juma, Amina, and Zawadi grew up with their grandmother.  <br>By 2020, Juma, then 10, quit school to sell scrap metal. Rosie's health crumbled under the weight of laundry baskets, her remittances shrinking. “Money wasn't enough,” she admits, eyes distant.  <br><br>This June, a call changed everything. Amina, 13, was slipping into depression, missing her mother's touch. Rosie quit, forfeiting three months' pay, and landed in Nairobi on July 28.  <br>The reunion at JKIA was tearful. Amina clung to Rosie, Juma grinned shyly, and Zawadi, 4, asked about \"Mama's palace.\" Kibera's reality leaky roofs, red dirt hit hard, but Rosie was home.  <br><br>Adjusting hasn't been easy. Juma's school fees drained her savings. Zawadi wonders why there's no pool. Yet, Rosie's resilience shines. She's turned her home into a daycare for 12 kids.  <br><br>Charging Ksh. 200 daily, Rosie teaches rhymes learned in Qatar. \"It's small, but it's ours,\" she says, watching toddlers play. Neighbours call her a hero, inspired by her grit.  <br><br>Community support has poured in. A church donated a solar lamp, a Sacco offered a microloan. Rosie's story, shared online, resonates across Kibera's tight-knit lanes.  <br><br>Her daycare grows, fuelled by skills and heart. “She's building futures,” says neighbor Fatuma, a single mother. Rosie's kids now dream bigger, Juma wants to play football, Amina sketches dresses.  <br><br>Central Bank data shows Kenyan women abroad send $4 billion yearly. Rosie's sacrifice mirrors theirs, but her return speaks louder, family over dollars.  <br>As dusk falls, Rosie shares sukuma wiki with her kids. \"We're poor in pockets, rich in love,\" she quips, ruffling Zawadi's braids. Kibera's stars twinkle above.  <br><br>August's rains flooded paths, but Rosie's homecoming lights Kibera. \"I chased gold, but found my heart here,\" she says, her smile a quiet triumph.",
      "author": "Patrick Mugure",
      "date": "October 3, 2025",
      "timestamp": 1759449600000,
      "categories": [
        "Human Interest"
      ],
      "tags": [],
      "imageUrl": "/images/rozie.jpeg"
    },
    {
      "id": "1759506368596",
      "title": "University Strike",
      "body": "With the September sun shining on vacant lecture rooms throughout Kenya, the country's public universities come to a standstill, their hallways filled with the disappointment of countless stranded students.<br><br>The nationwide strike by university lecturers, now in its 11th day, erupted on September 17 after talks between the Universities Academic Staff Union (UASU) and the government crumbled. Led by UASU Secretary General Constantine Wasonga, dons demand the release of Sh2.73 billion in arrears from Phase Two of the 2021-2025 Collective Bargaining Agreement (CBA), settlement of Sh7.9 billion from the 2017-2021 CBA, and the kick-off of negotiations for the 2025-2029 CBA.  <br><br>In a last-ditch effort, the National Treasury disbursed Sh2.5 billion on September 23 for CBA implementation, but union leaders dismissed it as a \"partial fix,\" insisting on full payment wired to accounts. Education CS Julius Ogamba urged UASU to withdraw the strike notice issued on September 10, calling for conciliation to salvage the disrupted 2025-2026 academic year.  <br><br>The Employment and Labour Relations Court suspended the strike on September 19, ordering talks and responses by September 30, with hearings set for October 6. Yet, lecturers remain defiant, picketing campuses from Nairobi to Kisumu, defying the interdict amid accusations of government foot-dragging.  <br><br>For first-year students, barely two weeks into orientation, the blow is crushing. At Pwani University in Mombasa, Flavina Namkuru, 19, stares at her blank timetable. \"We were just settling in when virtual classes vanished. Now, we're ghosts on campus,\" she says, joining a WhatsApp group for self-study tips.  <br><br>In Kisumu, Maseno University's Gloria Anyango, 18, has pivoted to her mitumba stall, hawking clothes to kill time. \"It's sad, but I'm turning lemons to lemonade. Still, exams loom; who'll teach us?\" she laments, her business booming amid the idle throng.  <br><br>The Kenya Universities Staff Union (KUSU), representing non-academic staff, has joined the fray, amplifying the shutdown. At the University of Nairobi, KUSU's Peter Waita rallies protesters: \"We've waited eight years for 2017 dues. No more games, wire the money or we stay out.\"  <br><br>Across 41 public universities, the ripple effects mount. Research labs idle, exams postponed, and libraries swell with aimless undergrads. Moi University's Acting UASU Secretary Dr. Dan Mukhwana warns: \"This ends only when CBAs are honored, no half-measures.\"  <br><br>Parents echo the outrage. From Eldoret, Robinson Kibet of KUSU urges recalls: \"Send kids home; no learning happens till payments clear.\" Social media erupts with #EndLecturersStrike, amassing 15,000 posts blending student pleas and union chants.  <br><br>The Salaries and Remuneration Commission (SRC) stands accused as the villain, ignoring a 2021 court order to boost budgets. UASU's Grace Nyongesa blasts: \"Taxes flow daily, yet higher education starves. This is systemic neglect.\"  <br><br>As September 27 dawns, uncertainty reigns. Private universities like Strathmore report enrollment spikes, but for the 80% in public institutions, dreams defer. Ian Omondi, a third-year engineering student at Egerton, scrolls job sites: \"Floods delayed us last year; now this? Our futures hang by a thread.\"  <br><br>The cycle of strikes, last year's two-week halt still fresh which exposes deeper woes in Kenya's education funding, now at Sh82 billion for 2025-2026, up from Sh44 billion in 2022 but strained by arrears.  <br><br>With court deadlines looming, Ogamba's plea for dialogue rings hollow to Wasonga: \"Letters won't feed families. Act, or the academic year crumbles.\" For now, Kenya's ivory towers stand silent, a stark reminder that unpaid promises echo loudest in empty halls.",
      "author": "Patrick Mugure",
      "date": "October 3, 2025",
      "timestamp": 1759449600000,
      "categories": [
        "Education"
      ],
      "tags": [],
      "imageUrl": "/images/uni.jpeg"
    },
    {
      "id": "1759506467486",
      "title": "Maize Wins",
      "body": "Within a laboratory at the Kenya Agricultural and Livestock Research Organization (KALRO) in Muguga, Dr. Esther Mwangi's group marked a subtle achievement: a novel maize variety that resists the harmful Maize Lethal Necrosis (MLN) disease.<br><br>The breakthrough, announced on August 10, could transform farming for Kenya's 3.5 million maize-dependent households. MLN, a viral disease spread by pests, has slashed yields by up to 90% in affected regions since 2011.  <br><br>Dr. Mwangi, 41, a plant geneticist, led the five-year project. \"We screened 200 maize lines and identified three with natural resistance,\" she said, peering through a microscope. The team crossbred these with local hybrids, boosting resilience without genetic modification.  <br><br>Field trials in Naivasha and Bomet showed the new variety, dubbed \"KALRO Shield,\" yielded 8 tons per hectare, double the output of standard maize under MLN pressure. \"It's a game-changer,\" said farmer John Kiptoo, 50, from Bomet.  <br><br>The project, funded by a KSh 300 million grant from the Bill & Melinda Gates Foundation, partnered with CIMMYT, a global maize research body. \"Kenya's innovation leads Africa,\" said CIMMYT's Dr. Sarah Okoth.  <br><br>Challenges remain. MLN's spread, worsened by climate-driven pest surges, threatens 30% of Kenya's maize belt. Scaling up seed production for KALRO Shield could take two years, per KALRO's director, Dr. Eliud Kireger.  <br><br>Farmers like Amina Wanjiku, 38, from Nakuru, are eager. \"Last year, I lost half my crop. This gives us hope,\" she said, inspecting trial plots. Maize supports 80% of Kenya's food security, per Ministry of Agriculture data.  <br><br>The science isn't flawless. Some varieties showed reduced resistance in humid coastal areas. \"We're refining for adaptability,\" Dr. Mwangi noted, tweaking DNA markers in her lab.  <br><br>Local communities rallied behind the effort. In Bomet, farmers donated land for trials. \"We trust our scientists,\" said elder Mary Chebet. On X, #KALROShield trended with 3,000 posts praising the work.  <br><br>The government pledged KSh 100 million to fast-track seed distribution by 2026. \"This is science for the people,\" said Agriculture CS Andrew Karanja at the launch.  <br><br>Dr. Mwangi's team is already eyeing sorghum and millet. \"We're not just fighting a disease; we're securing futures,\" she said, her lab buzzing with purpose.  <br><br>Kenya's maize fields, scarred by MLN, now glimpse recovery. KALRO Shield, born of local grit and global collaboration, promises harvests that endure.  <br><br>As August's rains nourish test plots, farmers wait, hopeful. \"This maize is our shield,\" Amina said, her hands in the soil, dreaming of full granaries.",
      "author": "Patrick Mugure",
      "date": "October 3, 2025",
      "timestamp": 1759449600000,
      "categories": [
        "Science"
      ],
      "tags": [],
      "imageUrl": "/images/Maize.jpeg"
    },
    {
      "id": "1759506550818",
      "title": "Mai Mahiu",
      "body": "Beneath the Great Rift Valley, the red soil of Mai Mahiu transformed into a violent flood on April 29, resulting in 48 deaths and 84 individuals missing. Four months later, survivors examine the scars, their murmurs a haunting tribute to a night when the heavens poured torrents.<br><br>The flash flood struck without mercy, breaching a railway embankment swollen by weeks of relentless rains. Homes in the Naivasha-adjacent village huddled against the tracks that were pulverized in minutes. \"The water came like a beast, roaring from the hills,\" recalls 62-year-old Mama Grace Wanjiku, her hands trembling as she clutches a faded photo of her grandson, swept away at 7.  <br><br>By dawn, the valley floor was a graveyard of twisted metal and splintered timber. Rescue teams from Nakuru County pulled 32 bodies from the debris, but the toll climbed as mud graves yielded more. \"We dug with bare hands, calling names into the void,\" says volunteer rescuer Joseph Mwangi, 35, his boots still caked in the silt of memory.  <br><br>Mai Mahiu, a farming hamlet of 5,000 reliant on Lake Naivasha's bounty, had weathered dry spells before. But climate-fueled downpours up 30% since 2020, per Kenya Meteorological Department data, overwhelmed outdated drains. \"The government built that rail for progress, but it became our dam of death,\" Wanjiku laments.  <br><br>Among the lost was teacher Elias Kiprop, 28, who herded 15 pupils to safety before the current claimed him. His widow, Lydia, 25, now tends their orphaned 2-year-old alone. \"He was our light; now we stumble in dark,\" she says, folding tiny uniforms stained with grief.  <br><br>Survivors like 19-year-old mechanic David Otieno lost everything twice, first to the flood, then to looters in the chaos. His workshop, a tin-roofed dream, lies buried under a meter of muck. \"I rebuilt after the 2018 floods. This time, my spirit broke,\" he admits, salvaging a wrench from the rubble.  <br><br>Aid trickled in slowly: KSh 10 million from the National Drought Management Authority for tents and food. Red Cross teams distributed blankets to 1,200 displaced families now crammed in Naivasha's schools. Yet, questions linger. \"Why no early warnings? Our phones stayed silent,\" demands village elder Samuel Njoroge, 70.  <br><br>The floods' ripple hit hard. Maize fields, Mai Mahiu's lifeline, drowned under sludge, slashing harvests by 70%. With 80% of households below the poverty line, hunger stalks the survivors. \"We eat one meal a day, posho and wild greens,\" Otieno says, his frame gaunt.  <br><br>Community bonds, forged in fire, hold firm. Women like Wanjiku form savings groups, pooling KSh 50 weekly for seeds. Youth dig communal latrines, warding off cholera's shadow. \"Tragedy stripped us bare, but not our fight,\" Njoroge says, leading a prayer circle at the flood's edge.  <br><br>Nationwide, the 2024 rains killed 238, per Interior Ministry tallies, exposing Kenya's vulnerability. Experts at the University of Nairobi blame deforestation and shoddy infrastructure. \"Mai Mahiu is a warning, act now or lose more valleys,\" warns climate researcher Dr. Amina Hassan.  <br><br>On X, #MaiMahiuFloods drew 10,000 posts, blending outrage with calls for climate justice. Donors chipped in Ksh 5 million via M-Changa, funding a memorial garden where wildflowers now nod over the lost.  <br><br>As August's sun bakes the cracked earth, Lydia plants sunflowers on Elias's grave. \"He'd want beauty from pain,\" she whispers. The floods recede, but Mai Mahiu's wounds fester a stark reminder that nature's fury spares no one.  <br><br>In the quiet evenings, survivors gather by the tracks, sharing tales under starlit skies. \"We lost our dead, but not our dawn,\" Wanjiku says, her voice rising like a hymn. From tragedy's depths, resilience rises, one stubborn seed at a time.",
      "author": "Patrick Mugure",
      "date": "October 3, 2025",
      "timestamp": 1759449600000,
      "categories": [
        "Tragedy"
      ],
      "tags": [],
      "imageUrl": "/images/rift.jpeg"
    },
    {
      "id": "1759506676989",
      "title": "KCB VS TUSKER",
      "body": "The 2025/26 SportPesa League kicked off with a statement victory for KCB FC, where they defeated Tusker FC 2-0 in the league opener at Moi International Sports Centre on Friday 19.<br><br>On the score sheet was their new signing and former Gor Mahia winger Boniface Omondi, who scored a first-half brace to secure all the three points, this sets them in the right path in pursuit of Sh15 million prize for the league champions.<br>Two-time Golden Boot winner Erick Kapaito squandered a 60th-minute penalty, dealing a further blow to 13 times champions Tusker FC's hopes of mounting a comeback.<br><br>KCB coach Robert Matano said that confidence, cohesion, determination and adequate preparation played a big part in winning the game.<br>“The boys implemented our plan as per our training practice so well. We have been together for two months and the results show that we have gelled well,” he said.<br><br>Coach Matano praised his team noting that locking the spaces, playing a combination play and maintaining the ball in the team worked out well. <br>“We have started, the journey is still long, 33 matches to go,” said Matano adding that he has integrated young and experienced players to have a solid team and to nurture young players.<br><br> On his part Tusker FC Coach Charles Okere said that the boys gave their best and coming to the next match they are going to rectify the mistakes that they made in the match.  <br><br>“It was a crucial match but unfortunately, we did not maximize our opportunities. Our team lacked cohesion, wasn't clinical in front of the goal but its an area we look forward to improve on,” he said, adding that dropping those points is something that they need to rectify as early as possible so that by the time the league comes to an end they are in a good position.<br><br>The head-to-head record between the two clubs has historically been dominated by Tusker. Prior to this match, Tusker had a clear edge in their past encounters across all competitions. In their previous 29 meetings, Tusker had won 15 matches, while KCB had only managed three victories, with the remaining 11 ending in a draw. This gave Tusker a win percentage of over 50% compared to KCB's mere 10%.",
      "author": "Ejidio Maina",
      "date": "October 3, 2025",
      "timestamp": 1759449600000,
      "categories": [
        "Sport"
      ],
      "tags": [],
      "imageUrl": "/images/tusker.jpeg"
    },
    {
      "id": "1760084757949",
      "title": "Kenyan Education Sector Faces Funding Cuts as Reforms Scale Up",
      "body": "NAIROBI — Kenya’s education system is undergoing sweeping reforms even as the government confronts significant budgetary constraints that threaten some of its free‐education commitments.<br>In the fiscal year 2025-26, the education sector was allocated KSh 702.7 billion, equivalent to 28% of the national budget, up from 27.6% in 2024-25. But despite the increased total, key programs face deep cuts. Primary school free‐education funds were trimmed from KSh 9.1 billion to about KSh 7 billion, while junior secondary and secondary capitation funds have also been reduced.<br><br>Education Cabinet Secretary John Mbadi said the capitation reductions — particularly for free primary, junior secondary, and free day secondary education — are necessary as the government reallocates funding to cover the rising cost of national examinations. Some of these funds will go to producing, invigilating, and distributing exam materials, an expense that has ballooned in recent years.<br><br>Despite the financial pressures, the government has matched the reforms with ambitious policy and structural changes intended to improve access, quality, and relevance of education. One of the headline reforms is the transition from the Competency-Based Curriculum (CBC) to a broader Competency-Based Education and Training (CBET) model, aimed at better alignment with both the job market and the realities of secondary and tertiary education.<br><br>To support these aims, Kenya has launched a large‐scale teacher recruitment drive. Since 2022, roughly 76,000 new primary and secondary teachers have been hired; an additional 24,000 are expected by December 2025, bringing the total to about 100,000 recruited in three years.<br>Infrastructure is also a major pillar of the reforms. The government reports that about 23,000 new classrooms have been constructed across the country since 2022 — 16,000 through the Ministry of Education and 7,000 via the Constituencies Development Fund.  In addition, plans are underway to build 1,600 science laboratories, particularly in underserved areas and in schools offering STEM‐oriented paths.<br><br>Still, some education stakeholders are raising concerns over the forthcoming end to government‐funded examination fee waivers, a policy in place for about a decade. From 2025, the government is exploring a cost‐sharing model for exam fees, meaning some parents—particularly those from more affluent households—may be required to contribute. Vulnerable learners are expected to retain full support under new measures.<br><br>In special education, Kenya is moving “from policy to inclusive classrooms,” with schools increasingly integrating learners with disabilities into mainstream settings, use of assistive devices, early assessments, and teacher training targeting inclusive pedagogies.<br><br>Going forward, the success of KBET (and CBET) will depend not just on policy design but on consistent funding, grassroots engagement (teachers, parents, students), and strong monitoring to ensure reforms reach remote, poor, and special needs learners.<br>",
      "author": "Vyonnah Nyambura",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Education"
      ],
      "tags": [
        "Education"
      ],
      "imageUrl": "/images/mbadi.jpeg"
    },
    {
      "id": "1760084870282",
      "title": "When Chalk Runs Dry: Universities at a Standstill",
      "body": "Lecturers and non-teaching staff at Kenya’s public universities began a nationwide strike last week, demanding the implementation of a long-overdue Collective Bargaining Agreement and payment of billions in salary arrears.<br><br>The industrial action, which commenced in the last week of September 2025, has effectively halted all lectures and essential administrative services, throwing the academic calendar for hundreds of thousands of students into disarray. Union officials have firmly rejected a government offer, escalating the standoff.<br><br>Specifically, the University Academic Staff Union (UASU) and allied non-teaching staff unions have rejected a government-offered payment of Ksh 2.7 billion. The unions assert that this sum is inadequate, arguing that the total outstanding dues for the 2017-2021 Collective Bargaining Agreement (CBA) amount to billions more.<br><br>\"No pay, no class,\" union officials stated firmly, indicating a lack of compromise.<br>The prolonged closure is causing significant distress among the student body. Students from institutions, such as Jomo Kenyatta University of Agriculture and Technology (JKUAT), have publicly lamented the disruption.<br><br>\"Our academic futures are in jeopardy,\" one student remarked, echoing the sentiment of many whose graduation timelines and learning schedules are now stalled.<br><br>Furthermore, the strike is compounded by an ongoing financial crisis within Kenya's higher education sector. This crisis is characterized by a massive deficit in the student capitation fund and the difficulties many institutions face in implementing the government's new financing model.<br><br>The current dispute centers on the implementation of the 2017-2021 CBA and the payment of salary arrears to nearly 30,000 striking workers. The nationwide strike has stopped learning, jeopardized research, and impacted graduation dates since it began in September 2025. The Ministry of Education has called for conciliation efforts. However, the unions maintain their position that work will not resume until their financial demands are met. The stalemate continues to disrupt the university's learning and the well-being of the striking employees.<br>",
      "author": "Denish Awajo",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Education"
      ],
      "tags": [
        "Education"
      ],
      "imageUrl": "/images/uni.jpeg"
    },
    {
      "id": "1760084955277",
      "title": "Flames of Litein: School Reduced to Ashes",
      "body": "LITEIN, Kenya — A fierce fire ravaged Litein School in Kericho County late Wednesday night, destroying nearly 80% of the institution’s infrastructure and leaving one of the region’s top schools in ruins. The blaze, starting after 10:00 p.m., consumed classrooms, the administration block, and the library, crushing the hopes of students and educators.<br><br>Emergency responders acted swiftly, but high winds and the school’s remote location hampered containment efforts. No fatalities were reported, though over 80% of the facilities were lost.<br>“We have lost everything — books, records, and the hopes of students preparing for exams,” said Headteacher Grace Rono, her voice heavy with grief. “This is a dark day for our community.”<br>The fire’s cause is under investigation, with Kericho County officials promising a thorough probe. Education Cabinet Secretary Dr. Ezekiel Mwangi pledged “immediate intervention” and formed a task force for reconstruction. County Education Director Peter Kipng’etich vowed resilience: “We will not abandon Litein School. It has shaped generations, and we will rebuild — brick by brick.”<br><br>By Thursday, locals gathered at the school, salvaging remnants and offering support. Boarders were evacuated and are temporarily housed in nearby homes and churches. The government is exploring options to ensure educational continuity.<br>The tragedy has fueled demands for reform. “This isn’t just a tragedy — it’s a failure of oversight,” said education analyst Dr. Sang. “How many more schools must burn before we act?” Parents and educators called for a nationwide audit of school safety, including fire extinguishers and emergency exits.<br><br>The fire exposes systemic issues: underinvestment and lax safety protocols. For students, it disrupts education and dims a school known for excellence. As Litein rebuilds, the tragedy underscores the urgent need to protect Kenya’s schools and their students’ futures.<br>",
      "author": "Vyonnah Nyambura",
      "categories": [
        "Tragedy"
      ],
      "tags": [],
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "imageUrl": "/images/leiten.jpeg"
    },
    {
      "id": "1760085062214",
      "title": "Shakahola’s Silent Graves: A Cult’s Deadly Legacy",
      "body": "Police and forensic experts recently discovered new suspected mass graves and exhumed human remains near the Shakahola cult site in Kwa Binzaro village, highlighting the bizarre loss of life linked to the self-proclaimed pastor, Paul Mackenzie.<br><br>The horrific discovery reemerged over the past month as investigators unearthed at least a dozen additional suspected bodies adjacent to the original forest site.<br><br>These fresh findings intensify the ongoing legal and forensic efforts, emphasizing the massive scale of the atrocity which has already claimed more than 450 victims.<br><br>Specifically, the remains are linked to Paul Mackenzie, who is currently facing charges related to the 2023 cult massacre. Followers of his Good News International Church were allegedly ordered to starve themselves to death to \"meet Jesus.\" The initial findings made this one of the world's deadliest cult-related incidents.<br><br>Consequently, Mackenzie and over 90 co-accused face multiple severe charges, including terrorism, murder, and child torture.<br><br>Government pathologist Dr. Richard Njoroge, speaking at the site of a previous exhumation, noted the macabre nature of the victims: “Nothing prepares you for shallow mass graves of children.”<br>The continuous discovery of human remains has renewed national interest and put immense pressure on the government. The Former Interior Cabinet Secretary, Kithure Kindiki, had previously asserted, \"This horrendous blight on our conscience must lead not only to the most severe punishment of the perpetrators of the atrocity... but tighter regulation (including self-regulation) of every church, mosque, temple or synagogue going forward.\"<br><br>The government aims to strengthen regulations on religious organizations to prevent future extremist actions. The forensic process of exhumation and identification continues in the Shakahola and Kwa Binzaro areas.<br>",
      "author": "Denish Awajo",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Tragedy"
      ],
      "tags": [
        "Tragedy Crime"
      ],
      "imageUrl": "/images/shaka.jpeg"
    },
    {
      "id": "1760085195526",
      "title": "Uhuru Kenyatta: The Return",
      "body": "Former President Uhuru Kenyatta announced his political comeback on September 26 at Jubilee Party's Ngong conference, vowing to rebuild the party, endorse Fred Matiang'i as 2027 candidate, and confront President William Ruto over economic woes and broken promises fuelling public unrest.  <br><br>Kenyatta, 63, rallied 5,000 delegates with a fiery speech: \"We've seen betrayal erode our gains. Jubilee rises to restore hope.\" The event, his first major outing since 2022, spotlighted Matiang'i, the ex-Interior CS who managed the last election's calm.<br>  <br>The declaration has splintered Kenya Kwanza, with MPs like Mwangi Kiunjuri threatening to cut Kenyatta's Sh1.3 million retirement pay. \"He's undermining the leadership he created,\" Kiunjuri said on October 6.  <br><br>Leveraging Mt Kenya loyalty where 42% still favor him per Infotrak, Kenyatta aims to erode Ruto's base. Deputy President Rigathi Gachagua retorted from Nyeri: \"Mt Kenya rejects yesterday's shadows for tomorrow's light.\"  <br><br>Matiang'i, 50, demurred: \"I'll serve if the people call, guided by Uhuru's vision.\" Jubilee's funding, tied to Kenyatta networks, positions it as a \"third force\" against Ruto and Raila Odinga.  <br>Odinga, chasing an AU role, tweeted support: \"Uhuru voices the betrayed masses. Accountability unites us.\" Azimio insiders fear vote fragmentation, however.  <br><br>Public fury; 15% inflation, delayed CBAs, 60 protest deaths in 2024 per Human Rights Watch bolsters Kenyatta's narrative. Gatundu farmer Joseph Mwangi, 70, said: \"He'll battle the hunger his successors ignored.\"  <br><br>Ruto extended an August 1 olive branch at State House, but tensions simmer. Transport CS Kipchumba Murkomen pledged Sh500 million in Mt Kenya roads on October 5 to reclaim support.  <br>#UhuruReturns hit 20,000 X posts, mixing phoenix imagery with #HustlerNation barbs. Boniface Mwangi posted: \"Dismantle dynasties or join them, Uhuru?\"  <br><br>Analyst Judy Muthoga warns: \"Post-tenure revivals flop, KANU's 2002 fate looms.\" Jubilee SG Jeremiah Kioni counters with youth-focused branch drives.  <br><br>The 2027 landscape heats: IEBC delays under NADCO, ethnic risks in by-elections like Narok's. Freedom House praises vibrancy but critiques \"ethnic deals.\"  <br><br>In Uhuru Park, activist Wanjiku Mwende, 22, weighs in: \"Change without feuds? I'm listening.\"  <br>Kenyatta's return isn't just personal vendetta, it's a strategic masterstroke tapping into disillusionment with Ruto's \"bottom-up\" model, which critics say has morphed into elite enrichment. With voter registration crawling at under 10% turnout in key regions, Jubilee's grassroots push could siphon disaffected youth and women voters, per a recent TIFA survey showing 35% national dissatisfaction with the administration.  <br><br>Insiders reveal Kenyatta has quietly mended fences with Odinga's inner circle, hinting at a potential Azimio-Jubilee pact to form a \"grand opposition\" bloc. \"The handshake 2.0 is in the works,\" whispered a source close to Matiang'i, though Odinga aides deny it, calling it \"speculative noise.\"  <br><br>For Ruto, the calculus is dire. His approval ratings hover at 38%, battered by floods, strikes, and a ballooning debt at 70% of GDP. Gachagua's aggressive Mt Kenya consolidation through harambees and anti-tax rhetoric may backfire if Kenyatta peels away moderates. \"This is a wake-up call; ignore it, and 2027 slips away,\" Muthoga added.  <br><br>As October unfolds, Kenyatta's shadow tests the hustler nation's resilience. Will Jubilee's phoenix soar, or crash like predecessors? In a polity scarred by dynasties and deals, one thing's clear: Kenya's political theatre just got its star back on stage, script rewritten for redemption or revenge.<br>",
      "author": "Patrick Mugure",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Politics"
      ],
      "tags": [
        "Politics Opposition"
      ],
      "imageUrl": "/images/Uhuru.jpeg"
    },
    {
      "id": "1760085289352",
      "title": "IEBC Schedules By Elections",
      "body": "The Independent Electoral and Boundaries Commission (IEBC) has scheduled a series of by-elections across the country for November 27, 2025, covering 24 vacant elective positions in the Senate, National Assembly, and County Assemblies.<br><br>According to Gazette Notice No. 11163, the upcoming mini-polls will include Senate seats, such as in Baringo County, as well as National Assembly constituencies including Banissa, Kasipul, Magarini, Malava, Mbeere North, and Ugunja. Several County Assembly wards will also head to the ballot, among them Angata Nanyokie in Samburu, Kariobangi North in Nairobi, and Metkei in Elgeyo Marakwet.<br><br>The electoral body outlined key milestones in the run-up to the polls, with pre-nomination meetings held on October 3 while candidate registration will be conducted on October 8–9. The campaign period is now underway and will continue until November 24, just two days before Kenyans head to the ballot.<br><br>IEBC Chairperson has reaffirmed the commission’s readiness to deliver free, fair, and transparent by-elections within the set timelines, emphasizing that all 24 contests will be completed before the end of the year.<br><br>The by-elections follow vacancies created by court nullifications, resignations, and deaths of officeholders. The polls are expected to test political party strength ahead of the 2027 General Election, with major parties including UDA, ODM, Jubilee, and Wiper expected to field candidates in key battleground constituencies.<br><br>The IEBC has urged political parties and candidates to conduct peaceful campaigns and adhere to the Electoral Code of Conduct, warning that violations will attract disqualification or prosecution.<br>“We are committed to ensuring that these by-elections meet the highest standards of credibility and transparency,” the IEBC stated. “All stakeholders must uphold peace and integrity throughout the process.”<br><br>Analysts note that these by-elections not only test the preparedness of the Independent Electoral and Boundaries Commission (IEBC) but also provide early indicators of voter sentiment and regional political shifts ahead of the 2027 General Election.<br>",
      "author": "Ejidio Maina",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Politics"
      ],
      "tags": [
        "Elections politics"
      ],
      "imageUrl": "/images/IEBC.jpeg"
    },
    {
      "id": "1760085368008",
      "title": "Ruto’s Seat at the Table: Africa’s Push for Power at the UN",
      "body": "President William Ruto, while speaking at the United Nations General Assembly in September 2025, strongly demanded a permanent African seat on the UN Security Council, sharply criticizing the body’s current \"unfair\" structure.<br><br>President Ruto delivered a powerful speech, positioning Kenya as a leading voice for global governance reform. He argued that the continent's continued exclusion from permanent membership is a grave injustice to a continent of 1.4 billion people.<br><br>\"Africa's exclusion is not only unacceptable, unfair, and grossly unjust, it also undermines the very credibility of the United Nations,\" the President stated.<br><br>Furthermore, the diplomatic push aligns with the Ezulwini Consensus, which represents Africa's common position on the Security Council reform. This consensus calls for not less than two permanent seats with all the privileges, including the veto, and two additional non-permanent seats for Africa. President Ruto emphasized this, stating, \"You cannot claim to be the United Nations while disregarding the voice of 54 nations. It is not possible.\"<br><br>The President underscored that the reform is not a favor but a necessity for the global body's survival. He noted that Africa dominates much of the Council's agenda, provides large peacekeeping contingents, and yet \"bears the heaviest costs of instability, yet remains the only continent without a permanent seat at the main table.\" He stressed that the UN must \"reflect today's realities, not the postwar power arrangements of 1945.\"<br><br>Domestically, this foreign policy cornerstone seeks to amplify Africa's role in international decision-making on matters of peace and security. In addition, the move momentarily shifts focus from internal economic pressures, such as the high cost of living and domestic tax policies that recently triggered massive anti-government protests.<br>",
      "author": "Denish Awajo",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Politics"
      ],
      "tags": [
        "Diplomacy"
      ],
      "imageUrl": "/images/ruto.jpeg"
    },
    {
      "id": "1760085538611",
      "title": "Kenya to Host 2025 East African Business & Investment Summit and Expo",
      "body": "Kenya will host the 2025 East African Business & Investment Summit and Expo in Nairobi on October 16–17, bringing together regional leaders, investors, and policymakers to boost trade and economic integration.<br><br>The two-day summit, organized by the East African Business Council (EABC) in collaboration with the East African Community (EAC) and the Kenya Investment Authority (KenInvest), will provide a platform for the public and private sectors to explore investment opportunities, address trade barriers, and promote regional development.<br><br>Themed “Promoting Private Sector-Driven Regional Integration for Increased Intra- and Extra-EAC Trade and Investment,” the event seeks to enhance economic cooperation and encourage private-sector participation in driving growth.<br><br>According to EABC Executive Director John Bosco Kalisa, the summit will enable the private sector to engage policymakers directly on strategies to make East Africa more competitive and attractive to investors.<br><br>“The summit provides an opportunity for the private sector to directly engage policymakers on how to make East Africa a more competitive and attractive destination for investment,” said Kalisa. “By fostering open dialogue, we aim to identify practical solutions to existing trade and investment barriers, enhance regional value chains, and position the EAC as Africa’s next major investment hub.”<br><br>Highlights will include CEO and ministerial roundtables, an investment expo, and business matchmaking sessions aimed at fostering cross-border partnerships. Outcomes and policy recommendations from the summit will be presented to the EAC Council of Ministers for consideration.<br><br>The East African Business & Investment Summit & Expo is a flagship regional forum convened by the East African Business Council (EABC) in partnership with the East African Community (EAC). It serves as the region’s premier platform for dialogue between the private sector and policymakers, advancing regional integration and sustainable economic growth across EAC member states.<br>",
      "author": "Ejidio Maina",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Business"
      ],
      "tags": [
        "Business"
      ],
      "imageUrl": "/images/summit.jpeg"
    },
    {
      "id": "1760085617347",
      "title": "Ahadi ni Deni",
      "body": "The Nairobi City Water and Sewerage Company (NCWSC) has issued a stark ultimatum to thousands of residents and institutions owing over Sh10 billion in unpaid bills, announcing widespread disconnections starting October 15 in a bid to recover funds and stabilize operations battered by Kenya's 15 per cent inflation and rising debt.<br>  <br>In a notice dated October 6, NCWSC CEO Margaret Onyango warned that defaulters ranging from households to major hotels and government offices risk immediate supply halts unless payments are made. \"This is non-negotiable; our viability hangs by a thread,\" Onyango stated, revealing that arrears have ballooned to Sh10.2 billion since the 2024 floods disrupted billing and collections.<br> The crackdown targets high-profile debtors like the Kenyatta National Hospital (Sh450 million owed) and several city malls, with NCWSC deploying 200 teams for spot audits and cutoffs. Last month, a pilot in Eastlands disconnected 5,000 homes, recovering Sh150 million in two weeks, but sparking outrage over timing amid the ongoing lecturers' strike and fuel price hikes.<br><br>Nairobi's water woes trace to chronic underinvestment: The firm supplies just 600 million litres daily against a 1.2 billion demand, per Water Services Regulatory Board data, forcing 40 per cent of residents to rely on cartels charging up to Sh50 per 20-litre jerrycan. \"We're not punishing; we're surviving,\" Onyango defended, pledging reconnection fees waived for prompt payers.  <br><br>Businesses reel from the threat. Jomo Kenyatta International Airport, owing Sh200 million, has appealed for a payment plan, warning disruptions could snarl East Africa's busiest hub. \"One day without water cascades into hygiene crises and flight delays,\" said Airports CEO Alex Gitari, echoing fears from the Kenya Association of Hotelkeepers and Caterers (KAHC), whose members face Sh300 million in collective dues.  <br><br>The move aligns with President William Ruto's fiscal austerity push, including a Sh500 billion revenue target for 2025-26, but critics like economist Aly-Khan Satchu blast it as \"tone-deaf\" amid 7.5 per cent unemployment. \"Hitting the poor hardest while elites evade taxes? This fuels inequality,\" Satchu tweeted, igniting #WaterWars with 8,000 posts slamming NCWSC's leaky infrastructure.<br><br> Community backlash brews. In Kibera, activist Boniface Mwangi rallied 500 residents on October 6: \"Water is a right, not a privilege for payers.\" Slum dwellers, billed irregularly due to unmetered connections, fear cholera spikes, last year's outbreak killed 20 after similar cutoffs. NCWSC counters with a Sh2 billion metering drive, but rollout lags behind targets.  <br><br>Economically, the disconnections could shave 0.2 per cent off Nairobi's GDP, per a Kenya Institute for Public Policy Research and Analysis (KIPPRA) snapshot, hitting informal sectors like jua kali artisans hardest. \"No water, no welding; we're dead in the water,\" lamented Dagoretti welder John Mwangi, 45, whose Sh500 monthly bill triples in dry spells.  <br><br>Government allies push back. Environment CS Roselinda Soipan Tuya announced Sh1 billion in emergency boreholes on October 7, while Treasury allocated Sh300 million to NCWSC for debt relief. Yet, opposition MP James Gaichuhie decried: \"Ruto's 'hustler' fund starves while water flows to cronies.\"  <br><br>Broader ripples: Kenya's utilities sector, burdened by Sh50 billion in national arrears, mirrors the KPC privatisation furore, where sales fund bailouts but risk monopolies. NCWSC, 100 per cent county-owned, eyes public-private partnerships for Sh20 billion in upgrades.  <br><br>As October 15 nears, panic-buying jerrycans surges in markets. \"I'll pay half now, beg later,\" said single mother Fatuma Ali, 38, juggling school fees and rations. For Nairobi's 5 million thirsty souls, this isn't just a bill, it's a deluge of distrust in a system where every drop counts toward survival.<br>",
      "author": "Patrick Mugure",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Business"
      ],
      "tags": [],
      "imageUrl": "/images/county.jpeg"
    },
    {
      "id": "1760085698798",
      "title": "Counting Every Shilling: KRA’s Digital Grip on Landlords",
      "body": "The Kenya Revenue Authority (KRA) launched the Electronic Rental Income Tax System (eRITS) in April 2025, a digital platform designed to simplify rental income tax compliance for landlords.<br>This major regulatory and technological step aims to expand the tax base and significantly increase revenue collection from the real estate sector.<br><br>The Electronic Rental Income Tax System (eRITS) is seeking to streamline the previously complex process of filing and paying rental income tax. KRA reports that the platform enables landlords and property managers to file returns and make payments more easily.<br><br>The focus on digitizing compliance for rental income is a key part of the government’s efforts to meet ambitious revenue targets, especially amid rising national debt and pressure from the International Monetary Fund (IMF).<br><br>The Government estimates indicate that the annual potential revenue from the sector is over KES 100 billion, yet actual collections were reportedly around KES 17 billion annually, representing a significant compliance gap.<br><br>Treasury Principal Secretary Dr. Chris Kiptoo, while speaking at the launch, said that the country's sustainability \"depends on its ability to mobilize sufficient tax revenues.\"<br><br>The Monthly Rental Income (MRI) tax was introduced in 2016 for people earning rental income between KES 288,000 and KES 15 million annually. To encourage voluntary compliance, the government reduced the MRI tax rate from 10% to 7.5% of gross income, as from January 1, 2024.<br><br>The eRITS platform integrates with existing national platforms like eCitizen and GavaConnect, with plans to link to the Ministry of Lands’ Ardhisasa system to automatically match land ownership records with tax systems.<br><br>Experts, like Tax Partner Alex Mathini, have lauded the move, noting that the platform eases compliance for landlords.<br>",
      "author": "Denish Awajo",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Business"
      ],
      "tags": [],
      "imageUrl": "/images/kra.jpeg"
    },
    {
      "id": "1760085768876",
      "title": "Conjestina Wanjiku",
      "body": "A 42-year-old woman was detained in Mukurwe-ini, Nyeri County, on Wednesday after allegedly attacking her husband with a wooden stick during a dispute over family land, police reported.<br><br>The altercation took place around 7 p.m. in Gikondi village when Susan Wanjiku, a local farmer, reportedly assaulted her 45-year-old husband, James Maina, causing head injuries. Mukurwe-ini Sub-County Police Commander John Kiptoo said the couple was arguing over a two-acre inherited plot.<br><br>“The suspect accused her husband of planning to sell the land without her input, which led to the assault,” Kiptoo stated. “She allegedly struck him several times with a stick.”<br>Neighbours intervened after hearing Maina’s shouts, holding Wanjiku until police arrived. Maina was taken to Mukurwe-ini Sub-County Hospital, where he is being treated for a fractured skull and bruises. His condition is stable but critical, medics said.<br><br>Esther Nyambura, 38, a neighbour, told The Informer that tensions over the land had simmered for months. “Wanjiku was adamant about securing the land for their three children. She felt betrayed,” Nyambura said.<br>Wanjiku appeared at the Mukurwe-ini Law Courts on Thursday, facing charges of assault and causing grievous harm. She pleaded not guilty and was released on a KSh 50,000 bond, with her case set for September 10.<br>Area Chief Peter Gichuki called for peaceful resolutions to family disputes, noting a rise in domestic violence cases in Nyeri. “We’re engaging elders to mediate such issues,” he said.<br><br>Police are probing allegations that Maina was in talks with a local developer. The incident has ignited local debate, with some villagers defending Wanjiku’s stance on land rights and others decrying her actions.<br>",
      "author": "Patrick Mugure",
      "categories": [
        "Human Interest"
      ],
      "tags": [],
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "imageUrl": "/images/violence.jpeg"
    },
    {
      "id": "1760085845062",
      "title": "ILLICIT BREW CRISIS DEEPENS IN MURANG’A COUNTY",
      "body": "Authorities in Murang’a County have intensified a sweeping crackdown on the production and consumption of illicit alcohol amid growing concern over the substance’s devastating social and health impacts.<br><br>In Gaturi village, three men recently died after allegedly consuming a toxic homemade spirit suspected to contain methanol. Health officials at Murang’a Level 5 Hospital have since reported a spike in alcohol-related admissions, with several patients suffering from poisoning, blindness, and chronic liver complications.<br><br>“We are increasingly dealing with cases linked to adulterated brews,” said a senior medical officer at the hospital, who requested anonymity. “The situation is deeply worrying.”<br><br>In the past fortnight, police chiefs and county enforcement officers have raided several illegal brewing dens across Kangema, Maragua, and Kandara sub-counties. The operations resulted in the seizure of hundreds of litres of chang’aa and other unregulated spirits, the arrest of at least 25 suspects, and the destruction of multiple brewing sites.<br><br>Murang’a County Commissioner Mr. Evans Otieno confirmed that the multi-agency operation forms part of a nationwide directive aimed at eliminating the illegal alcohol trade, which has claimed numerous lives and crippled many households.<br><br>“We are conducting a sustained campaign against illicit brews. Those involved—whether brewers, distributors, or protectors of this trade—will face the full force of the law,” said Mr. Otieno during a press briefing in Murang’a town.<br><br>Religious and community leaders warn that the proliferation of illicit alcohol has eroded the county’s social fabric, contributing to family disintegration, school dropouts, and widespread poverty.<br><br>“The majority of consumers are young men in their productive years,” observed Pastor Samuel Njiru of Kandara. “Instead of working or supporting their families, they spend their days drinking toxic substances that destroy their health and livelihoods.”<br><br>While the ongoing crackdown has been welcomed by many residents, some leaders argue that enforcement alone is insufficient. They are urging the government to complement punitive measures with rehabilitation and economic empowerment initiatives.<br><br>“We must address the root causes—unemployment and hopelessness,” said Murang’a Woman Representative, Hon. Grace Njeri. “Without sustainable alternatives, these brews will continue to find consumers.”<br><br>As Murang’a County continues to battle the scourge of illicit alcohol, officials maintain that consistent enforcement, public awareness, and community cooperation are essential to ending the crisis that has for years plagued the regional financial and economic stability.<br>",
      "author": "Vyonnah Nyambura",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Human Interest"
      ],
      "tags": [],
      "imageUrl": "/images/muranga.jpeg"
    },
    {
      "id": "1760085980649",
      "title": "Myanmar Earthquake",
      "body": "More than 3,700 people perished in a 7.7-magnitude earthquake that ravaged central Myanmar on March 28, with recovery efforts crippled by civil war, censorship, and October rains.<br><br>The quake, centred near Mandalay along the Sagaing Fault, killed at least 3,768 in Myanmar and 18 in Thailand from a Bangkok skyscraper collapse. Over 5,100 were injured, and more than 200 remain missing, with underreporting likely in conflict zones.<br><br>CNN reported the death toll soaring from 1,000 to 1,600 within hours, as survivors dug through rubble with bare hands due to equipment shortages. The U.S. Geological Survey called it Myanmar’s deadliest quake since 1912, citing a 460-km surface rupture.<br><br>In Mandalay, the epicenter’s nearest major city, 1,500 homes collapsed, trapping families during midday prayers; at least 500 perished in mosques. BBC footage captured a woman rescued after 30 hours, though 6.4-magnitude aftershocks slowed efforts.<br><br>The disaster impacted 17 million across 57 townships, destroying 50,000 homes, thousands of schools and monasteries, and hundreds of hospitals. The UN estimates billions in damages, including Naypyidaw’s new airport and major roads.<br><br>In Thailand, tremors shook Bangkok 800 miles away, collapsing a 30-story building and injuring 35, with two possible heart attack deaths. Thai local TV aired images of rooftop pools spilling and high-rise evacuations on unstable soil.<br><br>Myanmar’s civil war, ongoing since the 2021 coup, worsened the crisis. The junta and rebels paused offensives briefly, but renewed airstrikes blocked aid. The National Unity Government declared a two-week halt in affected areas.<br><br>BBC noted Myanmar’s third-place ranking on the IRC’s 2025 crisis watchlist, with 20 million needing aid pre-quake. Now, nearly 22 million, over a third of the population require urgent food, shelter, and water, per UN updates.<br><br>CNN exposed substandard Chinese steel in Bangkok’s collapse, sparking probes into construction codes. In Myanmar, poor rural building standards amplified deaths, with experts urging seismic retrofitting.<br><br>Thai Red Cross volunteers, shown on local broadcasts, set up clinics swamped by crush injuries and dehydration cases. Disease risks loom in crowded camps, worsened by food shortages and prolonged power outages.<br><br>International aid includes EU airlifts of 80 tons of supplies, Japanese engineers, and $5 million from the UN’s emergency fund. The Red Cross seeks $100 million, but Myanmar’s 2025 aid plan remains 5% funded.<br><br>Thailand’s Senate held a minute of silence for victims, including those in collapsed religious sites. Economic losses cripple trade routes and Mandalay’s historic landmarks, with recovery costs in the billions.<br><br>As October monsoons threaten mudslides, BBC feeds show Sagaing survivors digging by hand. UN coordinator Marcoluigi Corsi called for global action: “This demands more than ceasefires; true solidarity to rebuild.”<br>",
      "author": "Denish Awajo",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "International"
      ],
      "tags": [],
      "imageUrl": "/images/mynmar.jpeg"
    },
    {
      "id": "1760086106017",
      "title": "Sauti Sol Returns",
      "body": "Sauti Sol, Kenya’s Afro-pop titans, roared back to the stage on October 5 at Carnivore Grounds, with frontman Bien Aime Baraza leading a sold-out reunion tour.  <br><br>The quartet; Bien, Chimano, Savara, Polycarp drew 12,000 fans, their largest Nairobi crowd since 2019, belting hits like Sura Yako in a three-hour spectacle that ended a two-year break.  <br> The hiatus, sparked by solo ventures in 2023, fueled fears of a permanent split.<br><br>Carnivore pulsed with nostalgia. Fans, draped in Kenyan flags, swayed to Nishike, while new single Mwewe, a love letter to resilience sparked a singalong under Nairobi’s starry sky.  <br><br>The tour, dubbed Sauti Sol Forever, follows a Sh100 million deal with Universal Music Africa, funding 10 East African stops. “This is our legacy,” guitarist Polycarp Otieno said backstage.  <br>Chimano’s flamboyant vocals and Savara’s drum riffs electrified. “We grew, but the soul’s unchanged,” Chimano, 35, told fans, his sequined jacket glinting in the spotlights.<br><br>Logistics tested the comeback. A 2024 flood-damaged Carnivore stage delayed rehearsals, while 30 % inflation hiked ticket prices to Sh3,000, yet fans filled every seat, defying economic gloom.  <br>Kenya’s music scene, with 1.2 million Spotify streams monthly, thrives on Sauti Sol’s return. Promoter Joe Kariuki hailed it: “They’re East Africa’s Beatles, uniting generations.”  <br><br>Nairobi youth, like 22-year-old student Mercy Wambui, danced till dawn. “Their music heals, jobless or not, we vibe,” she said, her braids bouncing in the crowd.  <br><br>Challenges linger: piracy cuts royalties, and regional gigs face visa snags. Still, manager Kevin Owino eyes global stages: “Next stop, Kigali; then, the world.”  <br><br>Community ties shine. Sauti Sol’s Sol Generation label mentors acts like Okello Max, whose opening set dazzled. “They lift us all,” Okello said, strumming post-show.  <br><br>The tour’s ripple: 5,000 jobs, from sound techs to vendors. Fans in Mombasa await the October 12 show, with 8,000 tickets sold. “Sauti Sol is Kenya’s heartbeat,” Kariuki added.<br><br>As Carnivore’s lights dimmed, Bien’s final note lingered: “We’re back for good.” In a nation craving joy, Sauti Sol’s reunion isn’t just music, it’s a defiant, soulful revival.<br>",
      "author": "Patrick Mugure",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Entertainment"
      ],
      "tags": [],
      "imageUrl": "/images/sautisol.jpeg"
    },
    {
      "id": "1760086175565",
      "title": "Nicki Minaj and Cardi B: The Feud That Refuses to Die",
      "body": "The long-running rivalry between rap titans Nicki Minaj and Cardi B reignited last week in a blistering three-day social media war, one that dragged their young children into the crossfire and drew condemnation from fans, fellow artists, and even 50 Cent.<br><br>What began as a dispute over album sales for Cardi’s new release, Am I the Drama? quickly spiraled into personal attacks, with allegations of drug abuse, fertility struggles, and cruel remarks about their children, Kulture (7), Blossom (2), and Minaj’s son, Papa Bear (4).<br><br>The escalation peaked on September 29, when Minaj mocked Cardi’s album, priced $4.99 during release week, despite its No. 1 debut on the Billboard 200 with 199,600 units. She paired the jab with digs at Cardi’s pregnancy reveal. Cardi fired back, calling Minaj “Cocaine Barbie” and twisting lyrics from Minaj’s Magnet to reference her brother’s imprisonment for child rape. Minaj retaliated with AI-generated memes of Cardi as Barney the Dinosaur and claims she was pregnant again amid rumors of HPV exposure.<br><br>By October 1, ironically Papa Bear’s birthday, things turned vicious. Minaj called Kulture a “roach” and “monkey,” before issuing a sarcastic “apology,” saying;<br>“Dear Kulture, truth is: I did all of this for a bigger purpose... you’re a cute child & lots of kids have cute little funny looking gums before they grow into all of their features. I apologize.”<br>Cardi dismissed the note as backhanded, firing back with a message aimed at Papa Bear, accusing Minaj of drug use and neglect. She also alleged Minaj’s son was “nonverbal,” while Minaj claimed Cardi had mocked her child for years.<br><br>The feud soon spilled over into a broader industry beef. Minaj accused Cardi of perjury and fraud, took shots at Roc Nation executives, and urged boycotts of Cardi-linked brands. Cardi threatened a face-to-face confrontation, saying, “I’M NOT THROWING AWAY MY CAREER... I’LL SEE YOU WHEN I SEE YOU”, while announcing her fourth pregnancy with NFL star Stefon Diggs, which reignited Minaj’s fertility taunts.<br><br>Public reaction was swift and damning. On X, one viral post lamented, “This Cardi B and Nicki Minaj beef got too serious… Y’all both could have left the kids out.” Hip-hop veterans 50 Cent and Waka Flocka Flame called the spat “toxic” and “corny,” while Charlamagne tha God suggested deeper personal wounds were at play. Even SZA, caught in Minaj’s stray shots, fired back online. Ironically, all the chaos boosted Cardi’s numbers. Am I the Drama? is expected to place 10 songs on next week’s Hot 100, surpassing Minaj’s Pink Friday 2.<br><br>This feud isn’t new. It traces back to 2017, when Cardi’s breakout Bodak Yellow challenged Minaj’s long reign. The tension boiled over during the Motorsport rollout in 2018,  when Cardi accused Minaj of sabotaging her verse, culminating in Cardi throwing a shoe at Minaj during New York Fashion Week. Since then, both have traded subtle jabs, but 2025’s eruption feels more personal, fueled by Cardi’s post-divorce resurgence and Minaj’s looming 2026 project.<br><br>As of Sunday, the 5th, both artists have gone quiet, though the silence feels temporary. The Barbz and Bardi Gang continue to wage war online, turning insults into trending topics. No lawsuits or reconciliations have followed, but the feud underscores hip-hop’s cutthroat landscape, where queens fight not just for charts, but for legacy.<br>",
      "author": "Denish Awajo",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Entertainment"
      ],
      "tags": [],
      "imageUrl": "/images/nicki.jpeg"
    },
    {
      "id": "1760086273577",
      "title": "Crime Rampant Rise in The Capital",
      "body": "A sharp rise in violent theft incidents across Nairobi County has sparked growing concern among residents and authorities alike, as criminals become increasingly brazen in their operations.<br><br>One of the most harrowing incidents occurred recently in Kayole, where 18-year-old Clinton Otieno was fatally stabbed by a gang of thugs during a nighttime robbery. Otieno, who was walking home with a friend, reportedly resisted the attackers’ demands before being stabbed multiple times. His companion sustained serious injuries and was rushed to the hospital in critical condition. Police say investigations are ongoing to apprehend the assailants.<br><br>In another violent episode in Eastleigh, a 20-year-old domestic worker, Hakimo Muhidin Ali, was brutally assaulted during a robbery inside her employer’s apartment. According to court reports, the suspects, including a Ugandan nanny and an accomplice, used a hammer to beat the victim before making away with gold jewellery, a laptop, and cash. The victim suffered head and leg injuries and required extensive medical treatment.<br><br>A separate confrontation in Kilimani saw police engage suspected robbers in a dramatic midnight shootout along Tigoni Road. Two suspects were shot dead while another escaped with injuries. Security officers recovered firearms, pangas, and stolen items at the scene. The incident has heightened anxiety in one of Nairobi’s most affluent suburbs, long considered relatively secure.<br>Police have intensified operations along major roads such as Thika Highway, Waiyaki Way, and Jogoo Road, following an upsurge in attacks targeting pedestrians and motorists during evening hours. At least 38 suspects have been arrested in recent crackdowns, according to official police reports.<br><br>Nairobi County Police Commander Adam Kiptoo confirmed that patrols have been stepped up in hotspot areas and appealed to the public to remain vigilant. “We are determined to dismantle criminal networks operating within the city. Our officers are working around the clock to ensure residents are safe and offenders are brought to justice,” he said.<br><br>Security analysts have linked the rise in theft-related violence to high unemployment and economic hardship, especially among youth in informal settlements. “The pattern of urban theft has evolved from opportunistic petty crime to organized, violent robbery,” noted criminologist Dr. Sarah Wambui. “Unless socioeconomic drivers such as joblessness and poverty are addressed, law enforcement alone cannot provide a lasting solution.”<br><br>Meanwhile, residents and business owners continue to urge both the national and county governments to improve street lighting, expand CCTV surveillance, and strengthen community policing.<br><br>As the city’s crime wave intensifies, many Nairobians have been forced to alter their routines—avoiding certain routes, closing businesses early, and relying on private transport—in a bid to stay safe.<br>",
      "author": "Denish Awajo",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Crime"
      ],
      "tags": [],
      "imageUrl": "/images/nairobi.jpeg"
    },
    {
      "id": "1760086331461",
      "title": "Residents of Kimbo, Juja Decry Rising Insecurity After Violent Attacks",
      "body": "Residents of Kimbo in Juja Constituency have raised alarm over increased insecurity, saying a surge in violent crime has left them in fear and demanding urgent police action.<br><br>This comes after a man was robbed of his valuables and stabbed several times in the early hours of August 30, 2025. The attack angered residents, many of whom say they have suffered similar ordeals at the hands of criminals.<br><br>The wave of attacks, including robberies and violent muggings, has become common, especially after dark. “You can’t walk alone at night anymore,” said one long-time resident who requested anonymity for fear of reprisals. “The criminals are operating with impunity, and it feels like the police are doing nothing.”<br><br>Teresa, a Kimbo resident, narrated her ordeal: “I lost my phone to thieves on a motorcycle. They slapped me and snatched it. A few days later, I recognized one of them at a stage in Kimbo but couldn’t confront him for fear of my safety.”<br><br>As fear grows, residents say they will keep speaking out and pressuring officials until their concerns are addressed.<br><br>In response, Juja Sub-County Police Commander assured residents that security operations have been intensified. He said additional patrols will be deployed in crime-prone areas, investigations into recent attacks are underway, and arrests are expected soon. “We are committed to restoring safety in Kimbo and ensuring that those behind these crimes are brought to justice,” he stated.<br>The rise in petty and violent crime is a recurring issue in rapidly urbanizing areas around major cities, as criminals exploit gaps in security and target residents commuting or returning home from work.<br>",
      "author": "Denish Awajo",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Crime"
      ],
      "tags": [],
      "imageUrl": "/images/juja.jpeg"
    },
    {
      "id": "1760086424093",
      "title": "Speedy Faith",
      "body": "Faith Kipyegon, Kenya’s middle-distance queen, smashed her own 1500m national record at Nyayo Stadium, signalling a fierce comeback for the 2026 Paris World Championships.  <br><br>On October 5, the 31-year-old surged to a 3:52.89 finish in the Athletics Kenya trials, slicing 0.07 seconds off her 2023 mark. Her stride, a blend of grace and grit, electrified 10,000 fans. <br> <br>“This is my rebirth,” Kipyegon beamed, her breath steady post-race. After a 2024 Olympic silver marred by a controversial disqualification scare, she’s hungry for Paris gold.  <br><br>The Eldoret native trained under coach Julius Kirwa, battling altitude and a nagging ankle injury from June’s rains. “Faith’s heart is her engine,” Kirwa said, praising her dawn sprints.  <br>Her rival; Ethiopia’s Gudaf Tsegay and Australia’s Jessica Hull, loom large. Tsegay’s 3:50.77 world record taunts, but Kipyegon’s pace suggests she’s closing the gap.  <br><br>Nairobi’s trials doubled as qualifiers for the African Championships. Kipyegon’s teammate, Nelly Chepchirchir, 25, clocked 4:01.12, securing her spot. “Faith pushes us all,” Chepchirchir said.  <br>Kenya’s athletics machine hums despite funding woes. Athletics Kenya’s Sh200 million budget, cut 10% post-2024 floods, strains travel plans. Still, 60 athletes qualified for Paris.  <br><br>Kipyegon’s journey inspires. In Iten, her hometown, schoolgirls mimic her stride on red-dirt tracks. “She’s our beacon,” said teacher Mary Cheruiyot, 40, hosting watch parties.  <br>Sponsors like Nike and Safaricom fuel her run, injecting Sh50 million into her training camp. “It’s for Kenya, not just me,” Kipyegon said, eyeing a third Olympic medal.<br><br> Challenges linger: Paris’s heat and Kenya’s economic crunch 15% inflation test logistics. Yet, Kirwa remains bullish: “Faith’s legs will outrun any storm.”  <br>The trials saw 5,000 youth cheer, a nod to Kenya’s athletics legacy, which boasts 113 Olympic medals since 1964. Kipyegon’s record run adds fire to that flame.  <br><br>Her next stop: a Dubai training camp in November. “I’m not done breaking clocks,” she vowed, her eyes fixed on Paris’s distant horizon.  <br><br>As Nyayo’s dust settles, Kipyegon’s sprint rekindles national pride. In a land of runners, her comeback isn’t just personal, its Kenya’s heartbeat, pounding toward global glory.<br>",
      "author": "Patrick Mugure",
      "date": "October 10, 2025",
      "timestamp": 1760054400000,
      "categories": [
        "Sport"
      ],
      "tags": [],
      "imageUrl": "/images/Faith.jpeg"
    },
    {
      "id": "1761028345300",
      "title": "Kibera MP Fined",
      "body": "The driver of Kibera Member of Parliament Peter Orero has been fined KSh 100,000 (or liable for a 12-month jail sentence in default) after a viral video showed him obstructing traffic and flouting road laws along Oloitoktok Road.<br><br>On October 9, 2025, the incident was recorded: the vehicle, a Toyota Prado driven by George Oduor, was seen overtaking a line of stationary cars by moving into the wrong side of the road. The manoeuvre blocked other road users and created a dangerous obstruction.<br><br>The altercation was captured by journalist Larry Madowo. In the video, MP Orero is heard encouraging his driver to continue, even daring Madowo to take the recording to President William Ruto, a hint at perceived impunity.<br>The driver then hurled verbal insults at the journalist, including being heard telling him “peleka kwa Ruto” (take it to Ruto) and calling him “takataka” meaning “trash.”<br><br>The case was pursued by police, who had earlier declared their intention to investigate after the video went viral, given that the behaviour seemed to violate the Traffic Act and common law on reckless driving and obstruction.<br>In Milimani Law Courts, before Senior Principal Magistrate Rose Ndombi, George Oduor pleaded guilty to the charge of dangerous overtaking.<br><br>The magistrate ruled that, despite mitigation (the driver claimed he was rushing to get someone to the airport), the law prescribed a maximum fine of KSh 100,000 or up to 12 months in prison for such an offence. The maximum penalty was imposed.<br><br>The debate has resurrected calls for stricter oversight of drivers serving politicians and for clearer protocols for motorcades and VIP travel so that traffic rules are respected and road users are not endangered.<br>The Kibera MP road obstruction saga is a story not just of one driver’s reckless overtaking, but of law, equality, and public trust. While one fine does not erase years of VIP-style road privileges, it may be a step toward reminding everyone – regardless of status – that the road rules apply to all. How much this moment shifts culture remains to be seen.<br>",
      "author": "Vyonnah Nyambura",
      "date": "October 21, 2025",
      "timestamp": 1761004800000,
      "categories": [
        "Human Interest"
      ],
      "tags": [],
      "imageUrl": "/images/kibra.jpeg"
    },
    {
      "id": "1761028554258",
      "title": "Kenyan Political Giant Raila Odinga Dies at 80 in India",
      "body": "Former Kenyan Prime Minister and veteran opposition leader Raila Amolo Odinga has died at the age of 80 after suffering a cardiac arrest while undergoing treatment in India. Odinga, a towering figure in Kenyan and African politics for decades, collapsed during a morning walk at an Ayurvedic treatment facility in Koothattukulam, Kerala, on Wednesday morning. His death creates an immediate and profound leadership vacuum in Kenya's political opposition.<br><br>Indian media reported that medical staff rushed Odinga to Devamatha Hospital in the nearby Ernakulam district, but doctors pronounced him dead shortly after 9:50 a.m. local time. Hospital sources, speaking on condition of anonymity, confirmed the cardiac event to news agencies, noting resuscitation efforts failed. Odinga had been in India for specialized Ayurvedic treatment, a facility his daughter had previously visited for her vision. The Kenyan Embassy in Delhi is coordinating efforts for the repatriation of his body.<br><br>Odinga's nearly five-decade career defined modern Kenyan democracy. Born in 1945, the son of Kenya's first Vice-President, he courageously endured years of detention without trial under the single-party regime of Daniel arap Moi for his pro-democracy activism. He served as the Prime Minister of Kenya from 2008 to 2013 in a power-sharing arrangement that ended post-election violence.Despite running for the presidency unsuccessfully five times—most recently in 2022—he remained a hugely influential leader, consistently demanding electoral justice and constitutional reform.<br><br>Leaders across the globe immediately expressed shock and grief at the news. Kenyan President William Ruto led the nation in mourning, while former Chief Justice David Maraga called Odinga a \"patriot, a pan-Africanist, a democrat and a leader who made significant contributions to democracy in Kenya and in Africa,\" posting his sentiments on X.Indian Prime Minister Narendra Modi described Odinga as a \"towering statesman\" and a \"cherished friend of India.\"<br><br>Odinga’s passing leaves the Azimio la Umoja One Kenya Coalition Party without its unifying force ahead of the 2027 general elections. Known affectionately by supporters as \"Baba,\" his populist rallies mobilized masses, demonstrating his powerful connection to ordinary Kenyans. \"Kenya has lost one of its most formidable leaders who shaped the trajectory of our beloved country,\" Maraga added. Political analysts suggest Odinga’s death will trigger a rapid realignment of political forces, challenging the stability of the current political landscape and the recent truce he struck with the government.<br>",
      "author": "Denish Awajo",
      "categories": [
        "Human Interest"
      ],
      "tags": [],
      "date": "October 21, 2025",
      "timestamp": 1761004800000,
      "imageUrl": "/images/Raila.jpeg"
    },
    {
      "id": "1761028786492",
      "title": "Jesus Fails to Return",
      "body": "The Ministry of Repentance and Holiness, led by popular televangelist Prophet David Owuor, has dismissed claims circulating on social media suggesting that the world would end on Saturday, August 2, 2025.<br><br>In a strongly worded statement, the church described the doomsday predictions linked to the church and it’s founder as false, baseless, and malicious. The church asserts that the statements were deliberately crafted to tarnish the reputation of both Prophet Owuor and the ministry.<br><br>The statement, signed by Senior Archbishop Michael Nieswand, emphasized that the Bible is clear on matters concerning the end of the world, citing Matthew 24:36, which states that “no one knows the day or hour when the Messiah will return.”<br><br>“We, the leadership and congregation of the Ministry of Repentance and Holiness, strongly denounce the recent spread of false and misleading information about the world ending on August 2, 2025,” the statement read.<br>“These claims are false, baseless, malicious, and intended to harm not only the reputation of the Prophet of the Lord, David Owuor, and the Ministry of Repentance and Holiness, but also the unity and testimony of our church.” the statement continued.<br><br>The ministry further urged media houses, bloggers, and social media users to verify information before publishing or sharing it, warning against the spread of misinformation that could mislead the public and cause unnecessary panic.<br><br>“As believers, we are called to pursue truth, peace, and righteousness. Let us not be quick to spread gossip, but instead be diligent in prayer, discernment, and unity,” the church noted.<br><br>Reports predicting the end of the world began circulating on various online platforms in late June 2025, claiming that Prophet Owuor had prophesied global destruction. The rumors quickly gained traction, sparking debate among Kenyans and international followers of the preacher.Prophet David Owuor, a controversial yet influential religious figure, is widely known for his large evangelistic rallies and trademark white suits. Among his followers, he is revered as a miracle worker and a man who has experienced several supernatural encounters.<br>The ministry reiterated that its teachings remain rooted in biblical repentance and holiness ",
      "author": "George Mwangi",
      "date": "October 21, 2025",
      "timestamp": 1761004800000,
      "categories": [
        "Human Interest"
      ],
      "tags": [],
      "imageUrl": "/images/owuor.jpeg"
    },
    {
      "id": "1761028872591",
      "title": "Hell’s Nun",
      "body": "A video showing a senior Catholic nun repeatedly slapping a younger nun at St. John's Rakwaro Minor Seminary in Homa Bay has gone viral, prompting an official response from the church and an internal investigation. The footage, widely circulated on social media, shows the older nun repeatedly striking the younger sister, who is heard asking, “Why are you beating me, Sister?” The incident is believed to have occurred on September 5, 2025.<br>On September 8, the Franciscan Sisters of St. Joseph (FSJ), also known as the Asumbi Sisters, released a statement addressing the incident. The Superior General, Sister Mary Goretty Ochieng, called the action a \"personal failing\" that \"does not represent the values\" of their congregation. Sister Ochieng added that violence of any kind is contrary to their core principles of \"joyful love and compassion.\"<br><br>The FSJ leadership has assured the public that they are addressing the matter internally to ensure the “dignity and well-being” of their members. The Association of Sisterhoods of Kenya (AOSK) has also called for calm as the matter is handled through the appropriate internal channels.<br><br>Meanwhile, Kenyans on social media expressed shock and condemnation, with many calling for external investigations and stricter accountability within religious institutions. The debate has widened into concerns about safeguarding vulnerable members of the Church.<br><br>Abuse scandals have long troubled the Catholic Church globally. Since the early 2000s, inquiries in the United States, Ireland, Germany, and Australia have uncovered widespread physical, emotional, and sexual abuse, often concealed by Church authorities.<br><br>In Africa, cases have been less public but are surfacing more frequently. Reports from Kenya, Uganda, and Nigeria highlight abuses tied to power imbalances in seminaries and convents. Advocates say many victims remain silent, citing stigma, fear, and deference to religious authority.<br>",
      "author": "Denish Awajo",
      "date": "October 21, 2025",
      "timestamp": 1761004800000,
      "categories": [
        "Human Interest"
      ],
      "tags": [],
      "imageUrl": "/images/Nun.jpeg"
    },
    {
      "id": "1761029013166",
      "title": " “No bans from us” Nacada says",
      "body": "The National Authority for the Campaign Against Alcohol and Drug Abuse (NACADA) has clarified that no bans have been introduced on alcohol advertising, online sales, home deliveries, or celebrity endorsements. The clarification follows public speculation after the launch of the National Policy for the Prevention, Management and Control of Alcohol, Drugs, and Substance Abuse earlier this week.<br><br>In a statement issued on Thursday, NACADA Chief Executive Officer Dr. Anthony Omerikwa emphasized that the policy document unveiled by the Cabinet Secretary for Interior and National Administration, Hon. Kipchumba Murkomen, is currently a set of policy recommendations and not enforceable law.<br><br>“We wish to emphasize that no bans have been introduced. These measures are currently policy recommendations, not law,” said Dr. Omerikwa. “Their inclusion aims to initiate legal and regulatory reviews, subject to proper procedures.”<br><br>Dr. Omerikwa noted that the policy is intended to serve as a guiding framework for addressing alcohol and substance abuse in Kenya. The next steps, he explained, will involve developing a multi-sectoral implementation framework that will engage key stakeholders from government agencies, industry players, civil society organizations, and the public.<br><br>He further assured that any proposals requiring legal backing will undergo a comprehensive and transparent review process, including wide-ranging consultations and public participation.<br>NACADA urged both the media and the public to interpret the policy as a roadmap rather than an enforcement directive, cautioning against misinformation about supposed bans or restrictions.<br><br>According to the authority, the goal of the policy is to protect young people from the dangers of alcohol and substance abuse, reduce harm, and promote a healthier and more productive society.<br>“The policy provides a foundation for constructive dialogue and coordinated national action on drug and substance abuse prevention,” NACADA concluded.<br>",
      "author": "George Mwangi",
      "date": "October 21, 2025",
      "timestamp": 1761004800000,
      "categories": [
        "Human Interest"
      ],
      "tags": [],
      "imageUrl": "/images/nacada.jpeg"
    },
    {
      "id": "1761029175724",
      "title": "Blood Moon",
      "body": "Tonight, Kenyans will have their eyes turned skywards as the country witnesses one of nature’s most mesmerizing spectacles.  A total lunar eclipse, popularly known as the “blood moon’’ will grace the Kenyan Skies from 8:31 p.m., when the Earth’s shadow will completely cover the moon, painting it deep red. This phenomena will be visible across many places in the country with exceptional viewing places especially known for star gazing , among them the Mt. Kenya National Park where this reader joined natures’ enthusiasts among them academicians for a week long camp in anticipation of this historical, once in a lifetime occurence.<br><br>Astronomy enthusiasts and curious onlookers started flocking to the high-altitude region of Mount Kenya National Park  at dawn a week ago where clear skies promise an unobstructed view of the celestial event.<br>“This is one of those moments where science meets beauty,” says Dr. Miriam Kilonzo, an astrophysicist at the University of Nairobi. “A total lunar eclipse like this occurs only when the Earth perfectly aligns between the sun and the moon, casting its shadow across the lunar surface. The reddish glow happens because sunlight is refracted through the Earth’s atmosphere. It’s like watching every sunrise and sunset on Earth reflected on the moon.<br><br>According to the Kenya Space Agency, the eclipse will begin at 6:28 p.m. with the penumbral phase, but the real show starts at 8:31 p.m. when the total eclipse begins. The moon will reach its darkest and most striking point around 9:12 p.m., before gradually returning to normal by 11:55 p.m.<br>For locals in the foothills of Mount Kenya, the event has stirred excitement and curiosity. Samuel Mwangi, a tour guide in Nanyuki, said many visitors have booked night hikes and camping experiences to catch the rare view. “We’ve had tourists coming from as far as Mombasa and even Uganda,” he said. “People want to see the blood moon from the highest point possible. It’s a great experience.”<br><br>But beyond the scientific wonder, cultural interpretations still thrive. Mama Gakenia, an elderly woman from Meru County, smiled as she shared her traditional view. “When the moon turns red, our grandparents used to say it’s the earth cleansing itself as  a sign of renewal.’’<br><br>Experts have advised that no special glasses are needed for viewing as it is safe to watch with the naked eye. However, binoculars or telescopes can enhance the spectacle.<br>Warm clothing is recommended for those planning to stay outdoors, especially in high-altitude areas where temperatures drop after sunset.<br><br>As Kenyans gather under the open sky, the red moon serves as a reminder of the shared wonder that binds humanity across science, culture, and curiosity. “Moments like this connect us,” Dr. Kilonzo reflected. “They remind us how beautiful our universe can be.”<br>",
      "author": "George Mwangi",
      "date": "October 21, 2025",
      "timestamp": 1761004800000,
      "categories": [
        "Science"
      ],
      "tags": [],
      "imageUrl": "/images/redmoon.jpeg"
    },
    {
      "id": "1761029349938",
      "title": "Regional Wrap- up",
      "body": "Thursday, October 10, 2025<br><br>Dodoma, Tanzania.<br><br>Preparations are underway for the October general elections, with President Samia Suluhu Hassan cleared by the electoral body to defend her seat. Her leadership has drawn both praise and criticism. Supporters commend her for restoring stability and improving Tanzania’s global image, while critics argue that the race is far from fair.<br>“President Samia is practically competing against herself,” said Dr. Peter Mukawimwana, a political analyst in Dar es Salaam. “Her main challenger, Tundu Lissu of the Chadema Party, is facing treason charges, making it difficult for the opposition to campaign freely.”<br><br>Kampala,Uganda<br><br>Long serving leader Yoweri Museveni has once again been cleared by the National Resistance Movement (NRM) to contest for another term, setting up yet another confrontation with opposition leader Robert Kyagulanyi, popularly known as Bobi Wine.<br>The political climate remains tense, with reports of violence and intimidation at opposition rallies. The situation worsened this week when two Kenyan human rights activists, Bob Njagi and David Oyoo, were reportedly abducted in Kampala. The two had been en route to meet Bobi Wine when their vehicle broke down. Witnesses allege that men believed to be police officers took them away.Their disappearance has sparked outrage among Kenyan activists, who have threatened demonstrations. “We just want them back home safely,” said Lydia Oyoo, sister to one of the missing men. The Kenyan Ministry of Foreign Affairs remains tight-lipped over the grievious human righys violations.<br><br>ADDIS, Ethiopia<br><br>Meanwhile, in Ethiopia, hope is rising following the official launch of the Grand Renaissance Dam, Africa’s largest hydroelectric project. Experts say the dam will significantly boost energy production and regional trade.<br>“This project is a symbol of progress,” said Dr. Tesfaye Alemu, an energy researcher in Addis Ababa. “It shows that East Africa can still move forward, even amid political challenges.”<br>",
      "author": "George Mwangi",
      "date": "October 21, 2025",
      "timestamp": 1761004800000,
      "categories": [
        "Other"
      ],
      "tags": [],
      "imageUrl": "/images/region.jpeg"
    },
    {
      "id": "1761029561627",
      "title": "Historic Israel-Hamas Ceasefire Deal Takes Effect, Hostages Freed",
      "body": "A long-awaited ceasefire agreement between Israel and the Palestinian militant group Hamas has taken effect, bringing the first significant pause in the devastating two-year conflict in Gaza and leading to the release of all remaining living Israeli hostages. The deal, brokered through intense international mediation, marks a critical initial step in a broader peace plan.<br><br>The truce, the first phase of a broader 20-point peace plan unveiled by US President Donald Trump, saw all 20 living Israeli hostages returned on Monday, days after Israel's cabinet formally approved the arrangement. In exchange, Israel released nearly 2,000 Palestinian prisoners and detainees.<br><br>The agreement mandates a significant surge in humanitarian aid, with up to 600 trucks per day expected to enter Gaza, according to the White House plan. However, the fragile truce faced an immediate test on Tuesday when Israel halved the aid flow, citing delays in the return of the remains of deceased hostages by Hamas.<br>The sentiment of cautious relief and high stakes was palpable. Khalil al-Hayya, a senior Hamas official and lead negotiator, reflected this during a televised speech, saying, “We declare today that we have reached an agreement to end the war and the aggression against our people.” Meanwhile, families of the hostages expressed \"overwhelming joy and relief\" at the news of their loved ones' return, according to the Hostages and Missing Families Forum.<br><br>The conflict, which erupted on October 7, 2023, following a massive attack by Hamas on southern Israel, has led to a major Israeli military offensive in the Gaza Strip. The operation has resulted in widespread destruction and the deaths of tens of thousands, overwhelmingly Palestinians, according to Gaza authorities. Previous attempts at sustained ceasefires, including one in November 2023 and another in March 2025, failed to hold. <br><br>This breakthrough deal, mediated primarily by the US, Egypt, and Qatar, requires a partial withdrawal of Israeli troops to new agreed-upon lines within Gaza, focusing on the immediate exchange of captives and prisoners and a massive boost in aid before tackling thornier issues like Hamas disarmament and future governance of the enclave. The US has committed to sending approximately 200 troops to Israel to help monitor the ceasefire and facilitate aid delivery.<br>",
      "author": "Denish Awajo",
      "date": "October 21, 2025",
      "timestamp": 1761004800000,
      "categories": [
        "International"
      ],
      "tags": [],
      "imageUrl": "/images/israel.jpeg"
    }
  ]
}