{
  "blogs": [
    {
      "title": "Morpheus",
      "body": "For i must venture to go and meet the fates, Fear of the fates have held me back for too long, why you may ask, i fear that my fate will be suffering yet i realize now that the fear itself is far much greater suffering. As a man I strive on a daily basis to learn self-overcoming and so i must be my own sysyphus and become an uberminch. ",
      "author": "The king of dreams",
      "id": "10"
    },
    {
      "id": "e1f9",
      "title": "A Quiet Place",
      "body": "\nImagine a world where your voice isn't just a tool for communication but a weapon against you, well this isn't some dystopian movie but my story through high school. The iconic Julie Andrews says “Your voice is your identity, it reveals everything about who you are, how you feel, and what you stand for”.  Voices can be agents of change, they can bring comfort, act as weapons, and bring us joy but, they also can be our greatest sources of pain.\n\nI had a high-pitched soprano in primary school, singing the highest of notes without much straining. My voice always stood out amongst my peers, during English classes the teacher always chose me to read out passages, and whenever given the opportunity I didn't disappoint,  I would imagine myself as Don Lemon, pronouncing every word with precision and grace. \nWhen I joined high school my voice still stood out despite everyone around me having a deep voice. Puberty had long sealed my fate to be a late bloomer, I was tiny and my voice was different, and different meant bad, my voice became my biggest source of attention and pain, “ You sound like a girl” they taunted, the teasing was relentless, and I began longing for a deep voice. I quickly learned to be silent, I learned to shrink myself since every time I voiced my opinion it was met with backlash and teasing.\n\nThe bullying, teasing, and name-calling go on for a long time. You spend most of the time hiding in the restrooms. You stop talking altogether, you no longer participate in discussions because of self-preservation. You mumble answers in class since shouting the answer will make your voice be heard. Before you know it you forget how to use your voice.\n\nAt 19 my voice did eventually break, I thought this would be my Midas Touch but all the negativity I had absorbed, all the insecurities I had developed didn't go away, I had forgotten how to talk well.\n\nThis cycle of silence could have continued, but fate intervened. One day, my roommate had a seizure. Panic surged through me. At that moment, the need to get help overrode my fear. I ran through the halls, shouting \"Help!\", for the first time in years I heard my voice. It was a primal sound, born from a desperate need. It felt like the weight on my shoulder had been lifted. I had never felt so free, must have been how Mandela felt when he was released.\n\nI contemplated heavily about what had happened, this experience was a revelation. The world didn't crumble when I used my voice. It saved my roommate. This realization hit me like a bolt of lightning. How much had I missed out on by staying silent? How many questions had I left unasked? How many songs had I left unsung?\n\nToday, I'm still on a journey of rediscovering my voice. I'm learning to embrace my unique voice, not out of defiance, but out of self-acceptance. My voice may not be the deepest, but it's mine, and I refuse to let fear silence it anymore. This experience taught me a valuable lesson: your voice is a gift, not a burden. Use it to connect, to express yourself, and to stand up for what you believe in. The world needs to hear your unique voice, so don't be afraid to let it out.\n\n\n",
      "author": "Denish Awajo"
    },
    {
      "id": "535c",
      "title": "What it Means to be Neurodivergent",
      "body": "\nWhen mental health started being cool on TikTok about a year ago, I was drawn to the idea of neurodivergence. I was sad and needed a reason why, so I turned to the pop psychologists for answers. The idea of neurodivergence resonated with me since “it felt right”. Once the algorithm realized I preferred reels that validated my confirmation bias, it fed them to me in endless streams. I was convinced I was neurodivergent, and I told my brother and parents to which they responded  “You are not”, this made me angry and I lashed out at them. The truth is when you are “trapped” in a toxic relationship and you are too afraid to leave it starts to make you sad, you are just too scared to move on since you are convinced they are the one for you, so you start looking for something to blame for your unhappiness even if it's just a TikTok you bumped into at the right time. So what does it really mean to be neurodivergent? \n\nCleveland Clinic defines neurodivergence as a non-medical term that describes people whose brains develop or work differently for some reason. This means that the person has different strengths and struggles from people whose brains develop and work more typically. I know at this point you are surprised that it's a non-medical term, it is a woke term, and to my brother, if you are reading this, it has nothing to do with the Jews and it wasn’t coined by George Soros. To put it in simple words it is a polite word for “abnormal brain”. The irony in this all is there isn't a single definition of how a normal brain works. The term was coined by Judy Singer in 1998 to recognize that everyone’s brain develops uniquely. \n\nThis begs the question if neurodivergence is about the brain working differently and no single brain works the same as the next, why aren't we all neurodivergent? Listen, While it is true that all brains are unique and function slightly differently, the term is reserved for individuals whose brain difference significantly impact their daily lives and interactions eg in communication, social interaction, and learning. Before you can jump to conclusions you have to be diagnosed by a professional based on specific criteria and not everyone with a brain functioning differently meets this criterion. Some examples of neurodiverse conditions are Autism, ADHD, Dyslexia, Tourrettes, dyspraxia, and Down syndrome. \n\nThere is no one answer to what it is like to be neuro-diverse, there isn't even an answer to what it is like to have any specific neurodivergent diagnosis since people are individual and unique, we all experience and interpret life events differently. If you are neurodivergent you might have it a little harder than everyone else, I recognize and validate your struggle, it doesn't make you less of a person, I need you to know that you can accomplish great feats. Some notable neurodiverse people who made history include Marie Curie, Vincent Van Gogh, and Nikola Tesla. Don't sell yourself short of your abilities. It isn't an illness but rather a different way of learning and processing information.\n\n \n\n\n",
      "author": "Denish Awajo"
    },
    {
      "id": "9b48",
      "title": "Why You Should Care About That Green Lock: A Guide to SSL Certificates",
      "body": "\nHave you ever visited a website and immediately the Not secure message pops up from your browser?  If you are paranoid like me you leave the site immediately probably worried about your bank account being hacked, (though you've never even tried online banking or payments). So why is it that some websites give you this message and others don't?\n\nSeveral things go on behind the scenes when you build a website and host a website, one of those things is the purchase and implementation of an SSL certificate, websites that don't have an SSL certificate are marked as red flags by your browsers. So what exactly is an SSL certificate? Why do websites need them and why are they expensive? You heard that right, why are they expensive?\n\nSSL stands for secure socket layer, it is a security protocol that encrypts data that is transmitted across the web meaning anyone trying to intercept that data will only see a garbled mix of characters that is nearly impossible to decrypt. It is like you and your BFF having a secret language for communicating that no one else other than the two of you can understand. \n\nAn SSL certificate on the other hand is a digital certificate issued by the Certificate of Authority (trusted organizations mandated to verify websites and give out SSL certificates) for authenticating a website’s identity and enables encrypted conditions. It proves that the website is real and not a fake copy, in other words, it implements SSL. Think of it like a lock on a door, keeping your information safe when you visit the website.\n\nSo Why Do Websites Need SSL Certificates?\n\nWebsites require SSL certificates to, keep user data secure, verify website ownership, prevent attackers from creating false versions of the site, and convey trust to the users. So next time before you input your information into a website, make sure it is a secure site.\n\nSo What Makes SSL Certificates Expensive?\n\nCompared to the price you pay for hosting a website SSL can be perceived to be expensive. However, there are also a few organizations offering cheap SSL certificates, it's important to note that cheap and expensive certificates don't carry the same value. Below are some of the factors affecting the cost of an SSL certificate:\n\nValidation type\nThis is the main factor influencing the price of an SSL certificate, there are three types of validation:\n\nPrimary / Domain Validation - it is the lowest level of validation, used to verify ownership of a domain name. The certificate requester must have a generic email address to prove they control the domain.\n Organization Validation - this is the best option for businesses carrying out online transactions and handling sensitive data. The certificate authority verifies the authenticity of the business before issuing the certificate. It includes examining the business documents and may take a few days, hence pricier compared to domain validation.\nExtended validation - This is the highest form of validation and requires a rigorous validation process compared to the other types, often issued to certain organizations such as government agencies, this is the most expensive one.\n\nOther factors\n\nCertificate lifecycle - lifecycles could range from 1 to 2 years with the latter being expensive.\nNumber of domains and subdomains covered by the certificate \nMarket share of Certificate Authority - the bigger the market share the more likely to price competitively due to economies of scale\nReputation of Certificate of Authority\n\nThe type and cost you will incur on an SSL certificate ultimately depends on your business needs. Though the cost may vary it is still important to invest in one so as to keep your data safe.\n\n",
      "author": "Denish Awajo"
    },
    {
      "id": "0e41",
      "title": "The Boy Who Cried Color",
      "body": "\nI believe we all have something unique to offer the world because we are born different. Science supports this hypothesis since despite our DNA’s being 99% identical there are slight variations to every person. These variations may be small but they influence our physical appearance, susceptibility to disease, and even our talents. Right off the bat, difference is ingrained in us all. For me, I was born with a flamboyant taste, I made bold choices as a child which, my very well-hidden childhood photos portray.\n \nI come from an extremely religious family, my mom is a devout Christian and for as long as I can remember, every day before bed she read us stories from the bible, she read us the story of Noah, The story of Joseph, and The story of Daniel. She would put on a one-woman show bringing the stories to life. I particularly loved the story of Joseph with his infamous coat of many colors, Joseph’s dad bought him a coat with many colors that made him stand out from his brothers driving them mad with jealousy, and I begged her every time to perform it. I particularly loved Joseph because of this marvelous coat. I imagined the coat was tall and made of cashmere. I imagined it being swayed by the wind, just like Joseph I always made a fashion statement when leaving the house to stand out as much as possible, Oh the number of times I wore colorful dresses.\n\nFlamboyance got me in a lot of trouble growing up, while kids my age were out in the world wrestling and playing football, I accompanied my mom shopping for her chama outfits. I preferred staying indoors to watch Project Runway and reality TV. Kids my age thought me strange since not many of them could relate to the things I loved like my dress code, and how I talked. This caused a lot of teasing and name-calling which led to my social anxiety. I knew for sure at this point that I saw the world through a different lens than most. \n\nI often try hiding my uniqueness due to self-preservation, but the more I suppress it the stronger it grows, The more I ignore it the more it calls to me like a siren. Eventually, I'm learning to accept that this is me and this is how I express myself. Maybe I won't wear a flamboyant coat of many colors like Joseph, but I'll find ways to let my colors shine. I'm starting small, sharing my true self with trusted friends, and in safe environments like KamiLimu. It's scary, but with each step, the light feels a little brighter, pushing back the darkness. This journey of self-acceptance is my unique gift to the world, and I'm finally ready to share it.\n\n \n\n",
      "author": "Denish Awajo"
    },
    {
      "id": "cf7d",
      "title": "The History of HTML",
      "body": "\nAre you a software engineer, web developer or anyone curious about making websites or web applications? There is a 80% chance that you have come across and worked with HTML. Have you ever wondered how HTML came to be? Me too, in this article i will tell you the story of HTML.      \n\nFirst things first, what is HTML? Most people know html as a programming language for building websites, which is true, HTML stands for Hyper Text Markup Language, it is imperative we understand the term hypertext and mark up language first.\n\nOxford dictionary defines Hyper text as “a software system that allows extensive cross-referencing between related sections of a text and associated graphic material” . In simple terms they are like shortcuts that take you to different parts of the text that explains something in more detail, show you a picture or even play you a video. To better understand, imagine a book, instead of flipping through the pages, hypertexts allow you to jump where you want to go in a fun way.\n\nMarkup language refers to a text encoding system which specifies the structure and formatting of a document and potentially a relationship between its parts. Markup languages are inserted into documents to control their structures formally. Imagine you have written a story and you want to add instructions on how to read different parts like in scripts, markup language is like these instructions but they are directed to the computers, they tell the computer how to read the information.\n\nHTML, or HyperText Markup Language, is a system used to create and structure web pages. It allows you to add hyperlinks to text, which are like shortcuts that let you jump to different parts of the document or other web pages. Additionally, it includes special instructions, or markup, that tell a computer how to display and organize the content on a webpage, such as text, images, and videos. Generally speaking HTML is a formatting system for displaying materials displayed over the internet . Each retrieval is known as a web page. HTML is the markup language for encoding web pages.\n\n\nHTML was developed by a British scientist Tim Berners-Lee in 1991 while working at CERN ('Conseil européen pour la Recherche Nucléaire'), a European particle physics research  laboratory in Geneva . While at CERN developing procedures for diverse computers to communicate with one another and for researchers to control computers remotely, Tim recognized the need for a system that would allow researchers to easily access and share information. In 1989 Tim proposed the idea of a world Wide Web, in it He described a worldwide interconnected network of computers. Prior to this Tim had created a program for himself  called Enquire  that could store information in files that contained connectors both within and among separate files,  it allowed users to create, browse, and manage interconnected hypertext documents, laying the groundwork for the development of the World Wide Web.\n\nBack in 1989, Tim also developed a language in which documents in this network would be created and managed by people just like me and you. The language for these documents was HTML. At the time it was novel since it was human readable. The webpages at the time were more of what we think of as word documents today, something to be shared, read and edited  and mostly a conveyance of information. The first world wide web browser actually came shipped with a code editor inside of it, the intention was that all the documents of the world wide web would be editable by everybody, just like wikipedia.\n\n\nHTML 1.0 - 1993 (foundation and Basic Structure)\n\n This was the first version of HTML, its features included:\nBasic Text Formatting: headings (<h1> to <h6>), paragraphs (<p>), bold (<b>), and italic (<i>) text.\nHyperlinks: The <a> tag allows the creation of hyperlinks.\nLists: Ordered lists (<ol>), unordered lists (<ul>), and list items (<li>) \nImages: The <img> tag for embedding images within a web page.\nLine Breaks and Horizontal Rules: The <br> tag for line breaks and the <hr> tag for horizontal rules\nBasic Document Structure: The <html>, <head>, and <body> tags for defining the overall structure of a web page.\nDuring this time not many people were involved in website creation and this version was limited.\n\nHTML 2.0 - 1995 (enhanced interactivity)\n\nThis version contained features of the first HTML and integrated new features, It was developed by the Internet Engineering Task Force. HTML 2.0 aimed to be backward-compatible with HTML 1.0, ensuring that existing web pages would continue to work while providing a more robust and flexible framework for future web development. Some features it introduced include:\nForms: Introduced forms (<form>), allowing user input.\nTables: The <table> tag was included, enabling the creation of tables. \nEnhanced Text Elements: New text formatting elements like <strong> for strong emphasis and <em> for emphasis were added.\nImage Alignment: allowed for better control over image alignment with attributes like align.\nInternationalization: The standard included better support for international characters and text, accommodating a wider range of languages and scripts.\nDoctype Declaration: formalized the use of the <!DOCTYPE> declaration at the beginning of HTML documents, helping browsers to render pages correctly.\n\nHTML 3.0 -1997 (expanding capabilities)\n\nHTML 3.0 was a rather ambitious unsuccessful precursor of HTML 3.2. During this time several people were getting into the HTML and web development arena, these people came to be known as webmasters. Though standards offered by HTML 2.0 were decent at the time, webmasters thirsted for more capabilities. A company called Netscape introduced new proprietary tags and attributes to their Netscape navigator browser, these new abilities were called Netscape tags.\n\nThis caused problems if you designed a page using Netscape extensions, they would look terrible in other browsers. In response a team led by Dave Raggett introduced a new HTML draft, HTML 3.0. This new draft included so many changes and browsers were not able to implement all of them hence it was abandoned.After the issues with HTML 3.0, the World Wide Web Consortium (W3C) put measures in place to ensure future HTML designs would be modular, meaning they would be added in stages.\n\nHTML 3.2-1997(improved layout and scripting)\n\nBrowser specific tags kept popping up and it became apparent that a standard needed to be found hence The World Wide Web Consortium (W3C) was charged with standardizing the language and to keep it evolving . The W3C developed HTML 3.2. The project was known at first as WILBUR, later HTML 3.2. HTML 3.0 was toned down to change to existing standards, most browser specific tags from Netscape and Microsoft did not manage to be part of the new standards.\nNew features that were adopted by HTML 3.2 included: \nTables: Enhanced support for tables with <table>, <tr> (table row), <td> (table data), and <th> (table header) tags\nForms: Expanded form capabilities with support for new input types such as checkboxes, radio buttons, text fields, text areas, and drop-down menus (<select>).\nImage Maps: Introduced <map> and <area> tags \nClient-side Image Loading: Introduced the lowsrc attribute for the <img> tag \nScripting: Initial support for client-side scripting with the <script> tag, paving the way for JavaScript integration into web pages.\nImproved Accessibility: Introduced the alt attribute for the <img> tag \nMeta Information: Added the <meta> tag\n\nHTML 4.0 - 1999\n\nThis version was the last iteration of the classic HTML. This version introduced Cascading Style Sheets (CSS), which improved control over page styling. This version enhanced support for scripting and multimedia elements, it also added the ability to use frames which allowed web developers to divide a webpage into separate actions that can be updated independently.\n\nThe most remarkable features introduced during this iteration were the <div> and <span> tags which till date allow greater control over the presentation of web content.fun fact about HTML 4.0 is that it marked the end of an era for a blinky, attention-grabbing tag: the <blink> tag! This tag, used in earlier versions of HTML, made text blink on the screen. While some might find it eye-catching, it was generally considered annoying and distracting. HTML 4.0 decided to phase it out in favor of cleaner and less disruptive web design.\n This remained to be the dominant version for quite some time until HTML 5 came along in 2014.\n\nXHTML - 2000\n\nXHTML ( Extensible HyperText Markup Language) was derived from HTML to provide stricter rules for creating web pages that could be read by both humans and machines. It followed the same basic HTML syntax but it was based on stricter rules of XML (Extensible Markup Language) , This meant that the XHTML documents were well formed and conformed to a defined set of rules, making them easier to parse and validate by web browsers and other softwares. It dealt with HTML 4.0’s inconsistent handling of tags and attributes.\n\nWhile it did not achieve the widespread adoption envisioned by its creators, its principles influenced the development of HTML5, which has become the current standard for web development. \n\nHTML 5 - 2014\n\nThe stringent rules of XHTML made it less forgiving than HTML, leading to a steeper learning curve and increased complexity in development.The W3C recognized the need for a more practical approach, leading to the development of HTML5. HTML5 incorporated many features of XHTML while maintaining the more lenient syntax of HTML.\nIt introduced a wide range of new features and improvements over its predecessors, some features included;\nBetter support for multimedia\nImproved accessibility \nAudio and video support\nCanvas element\nOffline Web applications\nMobile support\nSemantic markup\n\nFrom the simple beginnings in the 1990s to the advanced capabilities we have today, the story of html is a testament of humanity’s pursuit for progress. Ladies and Gentlemen and that is the story of HTML.\n\n\n\n",
      "author": "Denish Awajo"
    },
    {
      "id": "862b",
      "title": "Stories",
      "body": "Stories\n\nGrowing up, I enjoyed spending time with my grandmother because she was an avid storyteller. She never made a point without telling a story and never told a story without making a point, this reputation earned her the nicknames ‘Jasigana’ and ‘Jangero’, meaning storyteller. Every night before bed she would spread the mat and place the tin - lamp in the middle and we would all gather together with my cousins in a semi-circle ready and eager to be thrilled about a new adventure.\n\nShe told us stories about, the hare and the tortoise, the fox and the elephant, Lwanda Magere ( a mythical hero made of stone), and her favorite were stories from her childhood growing up at the foot of Ramogi Hills where she was a feared wrestler and a skilled beloved dancer.\n\nI recall this part of my childhood fondly and looking back it never was about the stories but rather the art of storytelling itself. Jasigana brought her stories to life by making them relatable, authentic, and honest and invoking our emotions while at it. The plot of her stories put my cousins and me on a rollercoaster of emotions, one moment we were happy, the next we were worried, and at last inspired. \n\nShe always started by introducing her heroes with a strong opening, She would lower the pitch of her voice, put on her grass hat, widen her eyes, and say “chon-chon gi lala” meaning a very long time ago, and within seconds the whole room would go dead silent only the sound of crickets could be heard. After capturing our attention she’d make us love our hero then introduce the inciting incident happening to our hero, this could mean the Kalenjin warriors raiding our community and Lwanda Magere fighting back and defeating them. Then just when we think our hero is out of the woods, Jasigana further complicates the plot by bringing in a twist like introducing Lwanda Magere’s Evil wife. Even though we had heard these stories a thousand times, the descriptive language and alliteration put us all on edge wanting to know what happens next. \n\nGrandma would bring in the breakthrough moments when the hero finally emerges as the victor, This meant the tortoise winning the race or Lwanda Magere going down with thousands of Kalenjin warriors in his final battle. We learned a lot of different lessons from Jasigana’s stories. She added a lot of twists and turns in her stories; we were never certain about what could happen next. We realized trying to overcome uncertainty was futile since even the Kalenjin Warriors killed our fragile hero Lwanda Magere. The stories remind us that Everything we want lies on the other side of uncertainty and embracing difficulty is what prepares us for tomorrow. The only way to combat uncertainty is by building an anti-fragile system. \n\nEveryone has a story to tell, we tell ourselves stories in order to live. Through stories, we can form deep meaningful connections and engage with our audience effectively hence it is important to remember to tell the stories to the best of your abilities since people will forget your words but won't forget how you made them feel. \n",
      "author": "Wilhemina Slater"
    },
    {
      "id": "4713",
      "title": "KamiLimu Month 3 Lessons",
      "body": "\nKamilimu is a mentorship programme for tech students .These are just a few lessons I have learned during my third month.\n \nWe were introduced to git and portfolio,  we learned about branching which basically enables us work on features of a project independently from the main branch then merging the changes later once you are sure about them , we were also taught about github pages that enable us showcase projects , host blogs we could even showcase our resumes.\n\nThe lovely Dr Chao introduced us to human Centered design and we learnt about The 5 whys we need to answer in order to refine a problem statement,  on sources of problems she told us we could always create an artificial problem in case we have a good product just like the apple watch.\n\nOne of the most fun and engaging sessions of the season was responsible relationship building & leadership by Elijah Bakari, some key takeaways for me included ; People aren't always inherently malicious, it's all a matter of perspective and having different perspectives is healthy and should be embraced. Humility we learned isn't just about our weaknesses but rather being aware of both our strengths and weaknesses, we explored boundaries and also love languages.\n\nWe also learned about git for collaboration and open source, open source software we learned was one in which copyright holders grant users rights to use, study, change and distribute the software and its source code to anyone for any purpose. We were showed how to contribute to opensource projects on github and some benefits of open source include : security, control, stability Training and community\n\nDr Chao introduced us to storytelling using powerpoint and canva. We learned that with storytelling our presentation is 20x  more likely to be remembered. When presenting each slide should contain one idea and one character per slide. When speaking in public start with the set up , situate character in the struggle then solution or place of victory.\n\nDuring public speaking 2.0 we learned that research is the ability to gather and analyze information to answer a question or solve a problem. When researching about a speech you start from what you know, then identify gaps in your information questions and finally identify research sources. We also learn a specialty speech for the award, when presenting an award; introduce the award, tell a story, create anticipation and call the recipient.\n\nFinally there was problem solving using Data structure , We were reminded of the principles of object oriented programming which included; Encapsulation (in order to hide sensitive content), Inheritance (creating based on another), Polymorphism ( one thing having several uses) and abstraction ( displaying only essential information ).\n\n\n",
      "author": "Denish Awajo"
    },
    {
      "id": "8830",
      "title": "TRIBUTE TO MAMA BY JOHN ONDIEGI",
      "body": "\nMama you played it well, you kept the home lively. They enjoyed your food, they could come in numbers but that didn’t offend you. You would take our cows to the river but still you could not forget firewood Mama Oh! Mama even water you carried on your head as you tied your source of energy on your back mama.\nI was assured whenever you called me mama; as if it is not enough you knew when to plant our land mama. You woke up early in the wee hours to plough with our bulls (Tom & Oginga) Mama. Mama you did it and that’s the only way you could sustain us Mama. As I grew up mama those your dented fingers and rough palms because of hard-work disturbed me. It became real to me when I got a job in Nairobi, I saw you lonely and desperate mama. I realized  it was my time to be around mama . I turned away all the temptation to relocate to Nairobi mama, for your safety and happiness mama, it was a tough decision but they understood me mama.\nI have a home mama, fortunately even in your death they were with you. You died in her hands mama. She did all she could mama. I thank her for you mama. It is now a tough decision again mama; I confirmed it when I looked into your sitting room mama. I walked into your bedroom mama; I still thought you were  outside under the tree mama; oh mama my energy went for nothing; you had left, you were in the cold room mama.\nI followed you mama; they showed me your body mama; you were dead asleep mama; your hand folded mama; you refused to look at me mama; your eyes tight closed mama; I show your colleagues mama; they also surrender mama.\nSorry mama; sorry mama, meet  my beloved sisters and brothers; my beloved father ; meet my two step mothers ; they were waiting for you mama; they thought we delayed you mama; please we didn’t mama; tell them we are well. Thank you Mama ,good bye mama. \n",
      "author": "Denish Awajo"
    }
  ]
}